stm32duino/LSM6DSV16BX/src/lsm6dsv16bx_reg.h
/**
  ******************************************************************************
  * @file    lsm6dsv16bx_reg.h
  * @author  Sensors Software Solution Team
  * @brief   This file contains all the functions prototypes for the
  *          lsm6dsv16bx_reg.c driver.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2024 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef LSM6DSV16BX_REGS_H
#define LSM6DSV16BX_REGS_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include <stdint.h>
#include <stddef.h>
#include <math.h>

/** @addtogroup LSM6DSV16BX
  * @{
  *
  */

/** @defgroup  Endianness definitions
  * @{
  *
  */

#ifndef DRV_BYTE_ORDER
#ifndef __BYTE_ORDER__

#define DRV_LITTLE_ENDIAN 1234
#define DRV_BIG_ENDIAN    4321

/** if _BYTE_ORDER is not defined, choose the endianness of your architecture
  * by uncommenting the define which fits your platform endianness
  */
//#define DRV_BYTE_ORDER    DRV_BIG_ENDIAN
#define DRV_BYTE_ORDER    DRV_LITTLE_ENDIAN

#else /* defined __BYTE_ORDER__ */

#define DRV_LITTLE_ENDIAN  __ORDER_LITTLE_ENDIAN__
#define DRV_BIG_ENDIAN     __ORDER_BIG_ENDIAN__
#define DRV_BYTE_ORDER     __BYTE_ORDER__

#endif /* __BYTE_ORDER__*/
#endif /* DRV_BYTE_ORDER */

/**
  * @}
  *
  */

/** @defgroup STMicroelectronics sensors common types
  * @{
  *
  */

#ifndef MEMS_SHARED_TYPES
#define MEMS_SHARED_TYPES

typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t bit0                          : 1;
  uint8_t bit1                          : 1;
  uint8_t bit2                          : 1;
  uint8_t bit3                          : 1;
  uint8_t bit4                          : 1;
  uint8_t bit5                          : 1;
  uint8_t bit6                          : 1;
  uint8_t bit7                          : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t bit7                          : 1;
  uint8_t bit6                          : 1;
  uint8_t bit5                          : 1;
  uint8_t bit4                          : 1;
  uint8_t bit3                          : 1;
  uint8_t bit2                          : 1;
  uint8_t bit1                          : 1;
  uint8_t bit0                          : 1;
#endif /* DRV_BYTE_ORDER */
} bitwise_t;

#define PROPERTY_DISABLE                (0U)
#define PROPERTY_ENABLE                 (1U)

/** @addtogroup  Interfaces_Functions
  * @brief       This section provide a set of functions used to read and
  *              write a generic register of the device.
  *              MANDATORY: return 0 -> no Error.
  * @{
  *
  */

typedef int32_t (*stmdev_write_ptr)(void *, uint8_t, const uint8_t *, uint16_t);
typedef int32_t (*stmdev_read_ptr)(void *, uint8_t, uint8_t *, uint16_t);
typedef void (*stmdev_mdelay_ptr)(uint32_t millisec);

typedef struct {
  /** Component mandatory fields **/
  stmdev_write_ptr  write_reg;
  stmdev_read_ptr   read_reg;
  /** Component optional fields **/
  stmdev_mdelay_ptr   mdelay;
  /** Customizable optional pointer **/
  void *handle;
} stmdev_ctx_t;

/**
  * @}
  *
  */

#endif /* MEMS_SHARED_TYPES */

#ifndef MEMS_UCF_SHARED_TYPES
#define MEMS_UCF_SHARED_TYPES

/** @defgroup    Generic address-data structure definition
  * @brief       This structure is useful to load a predefined configuration
  *              of a sensor.
  *              You can create a sensor configuration by your own or using
  *              Unico / Unicleo tools available on STMicroelectronics
  *              web site.
  *
  * @{
  *
  */

typedef struct {
  uint8_t address;
  uint8_t data;
} ucf_line_t;

/**
  * @}
  *
  */

#endif /* MEMS_UCF_SHARED_TYPES */

/**
  * @}
  *
  */

/** @defgroup LSM6DSV16BX_Infos
  * @{
  *
  */

/** I2C Device Address 8 bit format  if SA0=0 -> D5 if SA0=1 -> D7 **/
#define LSM6DSV16BX_I2C_ADD_L                     0xD5U
#define LSM6DSV16BX_I2C_ADD_H                     0xD7U

/** Device Identification (Who am I) **/
#define LSM6DSV16BX_ID                            0x71U

/**
  * @}
  *
  */

/** @defgroup bitfields page main
  * @{
  *
  */

#define LSM6DSV16BX_FUNC_CFG_ACCESS               0x1U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t not_used0                     : 2;
  uint8_t sw_por                        : 1;
  uint8_t fsm_wr_ctrl_en                : 1;
  uint8_t not_used1                     : 3;
  uint8_t emb_func_reg_access           : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t emb_func_reg_access           : 1;
  uint8_t not_used1                     : 3;
  uint8_t fsm_wr_ctrl_en                : 1;
  uint8_t sw_por                        : 1;
  uint8_t not_used0                     : 2;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_func_cfg_access_t;

#define LSM6DSV16BX_PIN_CTRL                      0x2U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t not_used0                     : 5;
  uint8_t ibhr_por_en                   : 1;
  uint8_t sdo_pu_en                     : 1;
  uint8_t tdm_wclk_pu_dis               : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t tdm_wclk_pu_dis               : 1;
  uint8_t sdo_pu_en                     : 1;
  uint8_t ibhr_por_en                   : 1;
  uint8_t not_used0                     : 5;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_pin_ctrl_t;

#define LSM6DSV16BX_IF_CFG                        0x3U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t i2c_i3c_disable               : 1;
  uint8_t not_used0                     : 1;
  uint8_t sim                           : 1;
  uint8_t pp_od                         : 1;
  uint8_t h_lactive                     : 1;
  uint8_t asf_ctrl                      : 1;
  uint8_t tdm_out_pu_en                 : 1;
  uint8_t sda_pu_en                     : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t sda_pu_en                     : 1;
  uint8_t tdm_out_pu_en                 : 1;
  uint8_t asf_ctrl                      : 1;
  uint8_t h_lactive                     : 1;
  uint8_t pp_od                         : 1;
  uint8_t sim                           : 1;
  uint8_t not_used0                     : 1;
  uint8_t i2c_i3c_disable               : 1;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_if_cfg_t;

#define LSM6DSV16BX_FIFO_CTRL1                    0x7U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t wtm                           : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t wtm                           : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_fifo_ctrl1_t;

#define LSM6DSV16BX_FIFO_CTRL2                    0x8U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t xl_dualc_batch_from_fsm       : 1;
  uint8_t uncompr_rate                  : 2;
  uint8_t not_used0                     : 1;
  uint8_t odr_chg_en                    : 1;
  uint8_t not_used1                     : 1;
  uint8_t fifo_compr_rt_en              : 1;
  uint8_t stop_on_wtm                   : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t stop_on_wtm                   : 1;
  uint8_t fifo_compr_rt_en              : 1;
  uint8_t not_used1                     : 1;
  uint8_t odr_chg_en                    : 1;
  uint8_t not_used0                     : 1;
  uint8_t uncompr_rate                  : 2;
  uint8_t xl_dualc_batch_from_fsm       : 1;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_fifo_ctrl2_t;

#define LSM6DSV16BX_FIFO_CTRL3                    0x9U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t bdr_xl                        : 4;
  uint8_t bdr_gy                        : 4;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t bdr_gy                        : 4;
  uint8_t bdr_xl                        : 4;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_fifo_ctrl3_t;

#define LSM6DSV16BX_FIFO_CTRL4                    0x0AU
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t fifo_mode                     : 3;
  uint8_t not_used0                     : 1;
  uint8_t odr_t_batch                   : 2;
  uint8_t dec_ts_batch                  : 2;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t dec_ts_batch                  : 2;
  uint8_t odr_t_batch                   : 2;
  uint8_t not_used0                     : 1;
  uint8_t fifo_mode                     : 3;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_fifo_ctrl4_t;

