stm32duino/LSM6DSV16BX/src/lsm6dsv16bx_reg.h
#define LSM6DSV16BX_COUNTER_BDR_REG1              0x0BU
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t cnt_bdr_th                    : 2;
  uint8_t ah_qvar_batch_en              : 1;
  uint8_t not_used0                     : 2;
  uint8_t trig_counter_bdr              : 2;
  uint8_t not_used1                     : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used1                     : 1;
  uint8_t trig_counter_bdr              : 2;
  uint8_t not_used0                     : 2;
  uint8_t ah_qvar_batch_en              : 1;
  uint8_t cnt_bdr_th                    : 2;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_counter_bdr_reg1_t;

#define LSM6DSV16BX_COUNTER_BDR_REG2              0x0CU
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t cnt_bdr_th                    : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t cnt_bdr_th                    : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_counter_bdr_reg2_t;

#define LSM6DSV16BX_INT1_CTRL                     0x0DU
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t int1_drdy_xl                  : 1;
  uint8_t int1_drdy_g                   : 1;
  uint8_t not_used0                     : 1;
  uint8_t int1_fifo_th                  : 1;
  uint8_t int1_fifo_ovr                 : 1;
  uint8_t int1_fifo_full                : 1;
  uint8_t int1_cnt_bdr                  : 1;
  uint8_t not_used1                     : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used1                     : 1;
  uint8_t int1_cnt_bdr                  : 1;
  uint8_t int1_fifo_full                : 1;
  uint8_t int1_fifo_ovr                 : 1;
  uint8_t int1_fifo_th                  : 1;
  uint8_t not_used0                     : 1;
  uint8_t int1_drdy_g                   : 1;
  uint8_t int1_drdy_xl                  : 1;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_int1_ctrl_t;

#define LSM6DSV16BX_INT2_CTRL                     0x0EU
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t int2_drdy_xl                  : 1;
  uint8_t int2_drdy_g                   : 1;
  uint8_t not_used0                     : 1;
  uint8_t int2_fifo_th                  : 1;
  uint8_t int2_fifo_ovr                 : 1;
  uint8_t int2_fifo_full                : 1;
  uint8_t int2_cnt_bdr                  : 1;
  uint8_t int2_emb_func_endop           : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t int2_emb_func_endop           : 1;
  uint8_t int2_cnt_bdr                  : 1;
  uint8_t int2_fifo_full                : 1;
  uint8_t int2_fifo_ovr                 : 1;
  uint8_t int2_fifo_th                  : 1;
  uint8_t not_used0                     : 1;
  uint8_t int2_drdy_g                   : 1;
  uint8_t int2_drdy_xl                  : 1;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_int2_ctrl_t;

#define LSM6DSV16BX_WHO_AM_I                      0x0FU
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t id                            : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t id                            : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_who_am_i_t;

#define LSM6DSV16BX_CTRL1                         0x10U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t odr_xl                        : 4;
  uint8_t op_mode_xl                    : 3;
  uint8_t not_used0                     : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used0                     : 1;
  uint8_t op_mode_xl                    : 3;
  uint8_t odr_xl                        : 4;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_ctrl1_t;

#define LSM6DSV16BX_CTRL2                         0x11U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t odr_g                         : 4;
  uint8_t op_mode_g                     : 3;
  uint8_t not_used0                     : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used0                     : 1;
  uint8_t op_mode_g                     : 3;
  uint8_t odr_g                         : 4;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_ctrl2_t;

#define LSM6DSV16BX_CTRL3                         0x12U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t sw_reset                      : 1;
  uint8_t not_used0                     : 1;
  uint8_t if_inc                        : 1;
  uint8_t not_used1                     : 3;
  uint8_t bdu                           : 1;
  uint8_t boot                          : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t boot                          : 1;
  uint8_t bdu                           : 1;
  uint8_t not_used1                     : 3;
  uint8_t if_inc                        : 1;
  uint8_t not_used0                     : 1;
  uint8_t sw_reset                      : 1;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_ctrl3_t;

#define LSM6DSV16BX_CTRL4                         0x13U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t not_used1                     : 1;
  uint8_t drdy_pulsed                   : 1;
  uint8_t int2_drdy_temp                : 1;
  uint8_t drdy_mask                     : 1;
  uint8_t int2_on_int1                  : 1;
  uint8_t not_used0                     : 3;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used0                     : 3;
  uint8_t int2_on_int1                  : 1;
  uint8_t drdy_mask                     : 1;
  uint8_t int2_drdy_temp                : 1;
  uint8_t drdy_pulsed                   : 1;
  uint8_t not_used1                     : 1;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_ctrl4_t;

#define LSM6DSV16BX_CTRL5                         0x14U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t int_en_i3c                    : 1;
  uint8_t bus_act_sel                   : 2;
  uint8_t not_used0                     : 5;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used0                     : 5;
  uint8_t bus_act_sel                   : 2;
  uint8_t int_en_i3c                    : 1;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_ctrl5_t;

#define LSM6DSV16BX_CTRL6                         0x15U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t fs_g                          : 4;
  uint8_t lpf1_g_bw                     : 3;
  uint8_t not_used0                     : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used0                     : 1;
  uint8_t lpf1_g_bw                     : 3;
  uint8_t fs_g                          : 4;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_ctrl6_t;

#define LSM6DSV16BX_CTRL7                         0x16U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t lpf1_g_en                     : 1;
  uint8_t not_used0                     : 1;
  uint8_t ah_qvar2_en                   : 1;
  uint8_t ah_qvar1_en                   : 1;
  uint8_t ah_qvar_c_zin                 : 2;
  uint8_t int2_drdy_ah_qvar             : 1;
  uint8_t ah_qvar_en                    : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t ah_qvar_en                    : 1;
  uint8_t int2_drdy_ah_qvar             : 1;
  uint8_t ah_qvar_c_zin                 : 2;
  uint8_t ah_qvar1_en                   : 1;
  uint8_t ah_qvar2_en                   : 1;
  uint8_t not_used0                     : 1;
  uint8_t lpf1_g_en                     : 1;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_ctrl7_t;

#define LSM6DSV16BX_CTRL8                         0x17U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t fs_xl                         : 2;
  uint8_t not_used0                     : 1;
  uint8_t xl_dualc_en                   : 1;
  uint8_t ah_qvar_hpf                   : 1;
  uint8_t hp_lpf2_xl_bw                 : 3;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t hp_lpf2_xl_bw                 : 3;
  uint8_t ah_qvar_hpf                   : 1;
  uint8_t xl_dualc_en                   : 1;
  uint8_t not_used0                     : 1;
  uint8_t fs_xl                         : 2;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_ctrl8_t;

#define LSM6DSV16BX_CTRL9                         0x18U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t usr_off_on_out                : 1;
  uint8_t usr_off_w                     : 1;
  uint8_t not_used0                     : 1;
  uint8_t lpf2_xl_en                    : 1;
  uint8_t hp_slope_xl_en                : 1;
  uint8_t xl_fastsettl_mode             : 1;
  uint8_t hp_ref_mode_xl                : 1;
  uint8_t ah_qvar_lpf                   : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t ah_qvar_lpf                   : 1;
  uint8_t hp_ref_mode_xl                : 1;
  uint8_t xl_fastsettl_mode             : 1;
  uint8_t hp_slope_xl_en                : 1;
  uint8_t lpf2_xl_en                    : 1;
  uint8_t not_used0                     : 1;
  uint8_t usr_off_w                     : 1;
  uint8_t usr_off_on_out                : 1;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_ctrl9_t;

#define LSM6DSV16BX_CTRL10                        0x19U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t st_xl                         : 2;
  uint8_t st_g                          : 2;
  uint8_t xl_st_offset                  : 1;
  uint8_t ah_qvar_sw                    : 1;
  uint8_t emb_func_debug                : 1;
  uint8_t not_used0                     : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used0                     : 1;
  uint8_t emb_func_debug                : 1;
  uint8_t ah_qvar_sw                    : 1;
  uint8_t xl_st_offset                  : 1;
  uint8_t st_g                          : 2;
  uint8_t st_xl                         : 2;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_ctrl10_t;

#define LSM6DSV16BX_CTRL_STATUS                   0x1AU
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t not_used0                     : 2;
  uint8_t fsm_wr_ctrl_status            : 1;
  uint8_t not_used1                     : 5;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used1                     : 5;
  uint8_t fsm_wr_ctrl_status            : 1;
  uint8_t not_used0                     : 2;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_ctrl_status_t;

#define LSM6DSV16BX_FIFO_STATUS1                  0x1BU
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t diff_fifo                     : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t diff_fifo                     : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_fifo_status1_t;

#define LSM6DSV16BX_FIFO_STATUS2                  0x1CU
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t diff_fifo                     : 1;
  uint8_t not_used0                     : 2;
  uint8_t fifo_ovr_latched              : 1;
  uint8_t counter_bdr_ia                : 1;
  uint8_t fifo_full_ia                  : 1;
  uint8_t fifo_ovr_ia                   : 1;
  uint8_t fifo_wtm_ia                   : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t fifo_wtm_ia                   : 1;
  uint8_t fifo_ovr_ia                   : 1;
  uint8_t fifo_full_ia                  : 1;
  uint8_t counter_bdr_ia                : 1;
  uint8_t fifo_ovr_latched              : 1;
  uint8_t not_used0                     : 2;
  uint8_t diff_fifo                     : 1;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_fifo_status2_t;

#define LSM6DSV16BX_ALL_INT_SRC                   0x1DU
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t ff_ia                         : 1;
  uint8_t wu_ia                         : 1;
  uint8_t tap_ia                        : 1;
  uint8_t not_used0                     : 1;
  uint8_t d6d_ia                        : 1;
  uint8_t sleep_change_ia               : 1;
  uint8_t not_used1                     : 1;
  uint8_t emb_func_ia                   : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t emb_func_ia                   : 1;
  uint8_t not_used1                     : 1;
  uint8_t sleep_change_ia               : 1;
  uint8_t d6d_ia                        : 1;
  uint8_t not_used0                     : 1;
  uint8_t tap_ia                        : 1;
  uint8_t wu_ia                         : 1;
  uint8_t ff_ia                         : 1;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_all_int_src_t;

