stm32duino/LSM6DSV16BX/src/lsm6dsv16bx_reg.h
#define LSM6DSV16BX_STATUS_REG                    0x1EU
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t xlda                          : 1;
  uint8_t gda                           : 1;
  uint8_t tda                           : 1;
  uint8_t ah_qvarda                     : 1;
  uint8_t not_used0                     : 3;
  uint8_t timestamp_endcount            : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t timestamp_endcount            : 1;
  uint8_t not_used0                     : 3;
  uint8_t ah_qvarda                     : 1;
  uint8_t tda                           : 1;
  uint8_t gda                           : 1;
  uint8_t xlda                          : 1;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_status_reg_t;

#define LSM6DSV16BX_OUT_TEMP_L                    0x20U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t temp                          : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t temp                          : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_out_temp_l_t;

#define LSM6DSV16BX_OUT_TEMP_H                    0x21U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t temp                          : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t temp                          : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_out_temp_h_t;

#define LSM6DSV16BX_OUTX_L_G                      0x22U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t outx_g                        : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t outx_g                        : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_outx_l_g_t;

#define LSM6DSV16BX_OUTX_H_G                      0x23U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t outx_g                        : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t outx_g                        : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_outx_h_g_t;

#define LSM6DSV16BX_OUTY_L_G                      0x24U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t outy_g                        : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t outy_g                        : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_outy_l_g_t;

#define LSM6DSV16BX_OUTY_H_G                      0x25U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t outy_g                        : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t outy_g                        : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_outy_h_g_t;

#define LSM6DSV16BX_OUTZ_L_G                      0x26U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t outz_g                        : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t outz_g                        : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_outz_l_g_t;

#define LSM6DSV16BX_OUTZ_H_G                      0x27U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t outz_g                        : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t outz_g                        : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_outz_h_g_t;

#define LSM6DSV16BX_OUTZ_L_A                      0x28U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t outz_a                        : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t outz_a                        : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_outz_l_a_t;

#define LSM6DSV16BX_OUTZ_H_A                      0x29U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t outz_a                        : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t outz_a                        : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_outz_h_a_t;

#define LSM6DSV16BX_OUTY_L_A                      0x2AU
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t outy_a                        : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t outy_a                        : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_outy_l_a_t;

#define LSM6DSV16BX_OUTY_H_A                      0x2BU
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t outy_a                        : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t outy_a                        : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_outy_h_a_t;

#define LSM6DSV16BX_OUTX_L_A                      0x2CU
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t outx_a                        : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t outx_a                        : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_outx_l_a_t;

#define LSM6DSV16BX_OUTX_H_A                      0x2DU
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t outx_a                        : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t outx_a                        : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_outx_h_a_t;

#define LSM6DSV16BX_UI_OUTZ_L_A_DUALC             0x34U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t ui_outz_a_dualc               : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t ui_outz_a_dualc               : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_ui_outz_l_a_dualc_t;

#define LSM6DSV16BX_UI_OUTZ_H_A_DUALC             0x35U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t ui_outz_a_dualc               : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t ui_outz_a_dualc               : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_ui_outz_h_a_dualc_t;

#define LSM6DSV16BX_UI_OUTY_L_A_DUALC             0x36U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t ui_outy_a_dualc               : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t ui_outy_a_dualc               : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_ui_outy_l_a_dualc_t;

#define LSM6DSV16BX_UI_OUTY_H_A_DUALC             0x37U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t ui_outy_a_dualc               : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t ui_outy_a_dualc               : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_ui_outy_h_a_dualc_t;

