stm32duino/LSM6DSV16BX/src/lsm6dsv16bx_reg.h
#define LSM6DSV16BX_UI_OUTX_L_A_DUALC             0x38U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t ui_outx_a_dualc               : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t ui_outx_a_dualc               : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_ui_outx_l_a_dualc_t;

#define LSM6DSV16BX_UI_OUTX_H_A_DUALC             0x39U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t ui_outx_a_dualc               : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t ui_outx_a_dualc               : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_ui_outx_h_a_dualc_t;

#define LSM6DSV16BX_AH_QVAR_OUT_L                 0x3AU
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t ah_qvar                       : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t ah_qvar                       : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_ah_qvar_out_l_t;

#define LSM6DSV16BX_AH_QVAR_OUT_H                 0x3BU
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t ah_qvar                       : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t ah_qvar                       : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_ah_qvar_out_h_t;

#define LSM6DSV16BX_TIMESTAMP0                    0x40U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t timestamp                     : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t timestamp                     : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_timestamp0_t;

#define LSM6DSV16BX_TIMESTAMP1                    0x41U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t timestamp                     : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t timestamp                     : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_timestamp1_t;

#define LSM6DSV16BX_TIMESTAMP2                    0x42U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t timestamp                     : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t timestamp                     : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_timestamp2_t;

#define LSM6DSV16BX_TIMESTAMP3                    0x43U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t timestamp                     : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t timestamp                     : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_timestamp3_t;

#define LSM6DSV16BX_WAKE_UP_SRC                   0x45U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t x_wu                          : 1;
  uint8_t y_wu                          : 1;
  uint8_t z_wu                          : 1;
  uint8_t wu_ia                         : 1;
  uint8_t sleep_state                   : 1;
  uint8_t ff_ia                         : 1;
  uint8_t sleep_change_ia               : 1;
  uint8_t not_used0                     : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used0                     : 1;
  uint8_t sleep_change_ia               : 1;
  uint8_t ff_ia                         : 1;
  uint8_t sleep_state                   : 1;
  uint8_t wu_ia                         : 1;
  uint8_t z_wu                          : 1;
  uint8_t y_wu                          : 1;
  uint8_t x_wu                          : 1;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_wake_up_src_t;

#define LSM6DSV16BX_TAP_SRC                       0x46U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t x_tap                         : 1;
  uint8_t y_tap                         : 1;
  uint8_t z_tap                         : 1;
  uint8_t tap_sign                      : 1;
  uint8_t not_used0                     : 1;
  uint8_t double_tap                    : 1;
  uint8_t single_tap                    : 1;
  uint8_t tap_ia                        : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t tap_ia                        : 1;
  uint8_t single_tap                    : 1;
  uint8_t double_tap                    : 1;
  uint8_t not_used0                     : 1;
  uint8_t tap_sign                      : 1;
  uint8_t z_tap                         : 1;
  uint8_t y_tap                         : 1;
  uint8_t x_tap                         : 1;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_tap_src_t;

#define LSM6DSV16BX_D6D_SRC                       0x47U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t zl                            : 1;
  uint8_t zh                            : 1;
  uint8_t yl                            : 1;
  uint8_t yh                            : 1;
  uint8_t xl                            : 1;
  uint8_t xh                            : 1;
  uint8_t d6d_ia                        : 1;
  uint8_t not_used0                     : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used0                     : 1;
  uint8_t d6d_ia                        : 1;
  uint8_t xh                            : 1;
  uint8_t xl                            : 1;
  uint8_t yh                            : 1;
  uint8_t yl                            : 1;
  uint8_t zh                            : 1;
  uint8_t zl                            : 1;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_d6d_src_t;

#define LSM6DSV16BX_EMB_FUNC_STATUS_MAINPAGE      0x49U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t not_used0                     : 3;
  uint8_t is_step_det                   : 1;
  uint8_t is_tilt                       : 1;
  uint8_t is_sigmot                     : 1;
  uint8_t not_used1                     : 1;
  uint8_t is_fsm_lc                     : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t is_fsm_lc                     : 1;
  uint8_t not_used1                     : 1;
  uint8_t is_sigmot                     : 1;
  uint8_t is_tilt                       : 1;
  uint8_t is_step_det                   : 1;
  uint8_t not_used0                     : 3;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_emb_func_status_mainpage_t;

#define LSM6DSV16BX_FSM_STATUS_MAINPAGE           0x4AU
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t is_fsm1                       : 1;
  uint8_t is_fsm2                       : 1;
  uint8_t is_fsm3                       : 1;
  uint8_t is_fsm4                       : 1;
  uint8_t is_fsm5                       : 1;
  uint8_t is_fsm6                       : 1;
  uint8_t is_fsm7                       : 1;
  uint8_t is_fsm8                       : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t is_fsm8                       : 1;
  uint8_t is_fsm7                       : 1;
  uint8_t is_fsm6                       : 1;
  uint8_t is_fsm5                       : 1;
  uint8_t is_fsm4                       : 1;
  uint8_t is_fsm3                       : 1;
  uint8_t is_fsm2                       : 1;
  uint8_t is_fsm1                       : 1;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_fsm_status_mainpage_t;

#define LSM6DSV16BX_MLC_STATUS_MAINPAGE           0x4BU
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t is_mlc1                       : 1;
  uint8_t is_mlc2                       : 1;
  uint8_t is_mlc3                       : 1;
  uint8_t is_mlc4                       : 1;
  uint8_t not_used0                     : 4;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used0                     : 4;
  uint8_t is_mlc4                       : 1;
  uint8_t is_mlc3                       : 1;
  uint8_t is_mlc2                       : 1;
  uint8_t is_mlc1                       : 1;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_mlc_status_mainpage_t;

