stm32duino/LSM6DSV16BX/src/lsm6dsv16bx_reg.h
#define LSM6DSV16BX_INTERNAL_FREQ                 0x4FU
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t freq_fine                     : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t freq_fine                     : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_internal_freq_t;

#define LSM6DSV16BX_FUNCTIONS_ENABLE              0x50U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t inact_en                      : 2;
  uint8_t not_used0                     : 1;
  uint8_t dis_rst_lir_all_int           : 1;
  uint8_t not_used1                     : 2;
  uint8_t timestamp_en                  : 1;
  uint8_t interrupts_enable             : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t interrupts_enable             : 1;
  uint8_t timestamp_en                  : 1;
  uint8_t not_used1                     : 2;
  uint8_t dis_rst_lir_all_int           : 1;
  uint8_t not_used0                     : 1;
  uint8_t inact_en                      : 2;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_functions_enable_t;

#define LSM6DSV16BX_INACTIVITY_DUR                0x54U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t inact_dur                     : 2;
  uint8_t xl_inact_odr                  : 2;
  uint8_t wu_inact_ths_w                : 3;
  uint8_t sleep_status_on_int           : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t sleep_status_on_int           : 1;
  uint8_t wu_inact_ths_w                : 3;
  uint8_t xl_inact_odr                  : 2;
  uint8_t inact_dur                     : 2;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_inactivity_dur_t;

#define LSM6DSV16BX_INACTIVITY_THS                0x55U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t inact_ths                     : 6;
  uint8_t not_used0                     : 2;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used0                     : 2;
  uint8_t inact_ths                     : 6;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_inactivity_ths_t;

#define LSM6DSV16BX_TAP_CFG0                      0x56U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t lir                           : 1;
  uint8_t tap_x_en                      : 1;
  uint8_t tap_y_en                      : 1;
  uint8_t tap_z_en                      : 1;
  uint8_t slope_fds                     : 1;
  uint8_t hw_func_mask_xl_settl         : 1;
  uint8_t low_pass_on_6d                : 1;
  uint8_t not_used1                     : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used1                     : 1;
  uint8_t low_pass_on_6d                : 1;
  uint8_t hw_func_mask_xl_settl         : 1;
  uint8_t slope_fds                     : 1;
  uint8_t tap_z_en                      : 1;
  uint8_t tap_y_en                      : 1;
  uint8_t tap_x_en                      : 1;
  uint8_t lir                           : 1;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_tap_cfg0_t;

#define LSM6DSV16BX_TAP_CFG1                      0x57U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t tap_ths_z                     : 5;
  uint8_t tap_priority                  : 3;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t tap_priority                  : 3;
  uint8_t tap_ths_z                     : 5;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_tap_cfg1_t;

#define LSM6DSV16BX_TAP_CFG2                      0x58U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t tap_ths_y                     : 5;
  uint8_t not_used0                     : 3;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used0                     : 3;
  uint8_t tap_ths_y                     : 5;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_tap_cfg2_t;

#define LSM6DSV16BX_TAP_THS_6D                    0x59U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t tap_ths_x                     : 5;
  uint8_t sixd_ths                      : 2;
  uint8_t not_used0                     : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used0                     : 1;
  uint8_t sixd_ths                      : 2;
  uint8_t tap_ths_x                     : 5;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_tap_ths_6d_t;

#define LSM6DSV16BX_TAP_DUR                       0x5AU
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t shock                         : 2;
  uint8_t quiet                         : 2;
  uint8_t dur                           : 4;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t dur                           : 4;
  uint8_t quiet                         : 2;
  uint8_t shock                         : 2;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_tap_dur_t;

#define LSM6DSV16BX_WAKE_UP_THS                   0x5BU
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t wk_ths                        : 6;
  uint8_t usr_off_on_wu                 : 1;
  uint8_t single_double_tap             : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t single_double_tap             : 1;
  uint8_t usr_off_on_wu                 : 1;
  uint8_t wk_ths                        : 6;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_wake_up_ths_t;

#define LSM6DSV16BX_WAKE_UP_DUR                   0x5CU
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t sleep_dur                     : 4;
  uint8_t not_used0                     : 1;
  uint8_t wake_dur                      : 2;
  uint8_t ff_dur                        : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t ff_dur                        : 1;
  uint8_t wake_dur                      : 2;
  uint8_t not_used0                     : 1;
  uint8_t sleep_dur                     : 4;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_wake_up_dur_t;

#define LSM6DSV16BX_FREE_FALL                     0x5DU
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t ff_ths                        : 3;
  uint8_t ff_dur                        : 5;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t ff_dur                        : 5;
  uint8_t ff_ths                        : 3;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_free_fall_t;

#define LSM6DSV16BX_MD1_CFG                       0x5EU
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t not_used0                     : 1;
  uint8_t int1_emb_func                 : 1;
  uint8_t int1_6d                       : 1;
  uint8_t int1_double_tap               : 1;
  uint8_t int1_ff                       : 1;
  uint8_t int1_wu                       : 1;
  uint8_t int1_single_tap               : 1;
  uint8_t int1_sleep_change             : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t int1_sleep_change             : 1;
  uint8_t int1_single_tap               : 1;
  uint8_t int1_wu                       : 1;
  uint8_t int1_ff                       : 1;
  uint8_t int1_double_tap               : 1;
  uint8_t int1_6d                       : 1;
  uint8_t int1_emb_func                 : 1;
  uint8_t not_used0                     : 1;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_md1_cfg_t;

