stm32duino/LSM6DSV16BX/src/lsm6dsv16bx_reg.h
#define LSM6DSV16BX_MD2_CFG                       0x5FU
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t int2_timestamp                : 1;
  uint8_t int2_emb_func                 : 1;
  uint8_t int2_6d                       : 1;
  uint8_t int2_double_tap               : 1;
  uint8_t int2_ff                       : 1;
  uint8_t int2_wu                       : 1;
  uint8_t int2_single_tap               : 1;
  uint8_t int2_sleep_change             : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t int2_sleep_change             : 1;
  uint8_t int2_single_tap               : 1;
  uint8_t int2_wu                       : 1;
  uint8_t int2_ff                       : 1;
  uint8_t int2_double_tap               : 1;
  uint8_t int2_6d                       : 1;
  uint8_t int2_emb_func                 : 1;
  uint8_t int2_timestamp                : 1;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_md2_cfg_t;

#define LSM6DSV16BX_EMB_FUNC_CFG                  0x63U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t not_used0                     : 3;
  uint8_t emb_func_disable              : 1;
  uint8_t emb_func_irq_mask_xl_settl    : 1;
  uint8_t emb_func_irq_mask_g_settl     : 1;
  uint8_t not_used1                     : 1;
  uint8_t xl_dualc_batch_from_if        : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t xl_dualc_batch_from_if        : 1;
  uint8_t not_used1                     : 1;
  uint8_t emb_func_irq_mask_g_settl     : 1;
  uint8_t emb_func_irq_mask_xl_settl    : 1;
  uint8_t emb_func_disable              : 1;
  uint8_t not_used0                     : 3;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_emb_func_cfg_t;

#define LSM6DSV16BX_TDM_CFG0                      0x6CU
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t tdm_wclk_bclk_sel             : 1;
  uint8_t tdm_wclk                      : 2;
  uint8_t not_used0                     : 1;
  uint8_t tdm_slot_sel                  : 1;
  uint8_t tdm_bclk_edge_sel             : 1;
  uint8_t tdm_delayed_cfg               : 1;
  uint8_t not_used1                     : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used1                     : 1;
  uint8_t tdm_delayed_cfg               : 1;
  uint8_t tdm_bclk_edge_sel             : 1;
  uint8_t tdm_slot_sel                  : 1;
  uint8_t not_used0                     : 1;
  uint8_t tdm_wclk                      : 2;
  uint8_t tdm_wclk_bclk_sel             : 1;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_tdm_cfg0_t;

#define LSM6DSV16BX_TDM_CFG1                      0x6DU
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t not_used0                     : 3;
  uint8_t tdm_axes_ord_sel              : 2;
  uint8_t tdm_xl_z_en                   : 1;
  uint8_t tdm_xl_y_en                   : 1;
  uint8_t tdm_xl_x_en                   : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t tdm_xl_x_en                   : 1;
  uint8_t tdm_xl_y_en                   : 1;
  uint8_t tdm_xl_z_en                   : 1;
  uint8_t tdm_axes_ord_sel              : 2;
  uint8_t not_used0                     : 3;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_tdm_cfg1_t;

#define LSM6DSV16BX_TDM_CFG2                      0x6EU
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t tdm_fs_xl                     : 2;
  uint8_t not_used0                     : 1;
  uint8_t tdm_data_mask                 : 1;
  uint8_t not_used1                     : 4;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used1                     : 4;
  uint8_t tdm_data_mask                 : 1;
  uint8_t not_used0                     : 1;
  uint8_t tdm_fs_xl                     : 2;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_tdm_cfg2_t;

#define LSM6DSV16BX_Z_OFS_USR                     0x73U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t z_ofs_usr                     : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t z_ofs_usr                     : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_z_ofs_usr_t;

#define LSM6DSV16BX_Y_OFS_USR                     0x74U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t y_ofs_usr                     : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t y_ofs_usr                     : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_y_ofs_usr_t;

#define LSM6DSV16BX_X_OFS_USR                     0x75U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t x_ofs_usr                     : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t x_ofs_usr                     : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_x_ofs_usr_t;

#define LSM6DSV16BX_FIFO_DATA_OUT_TAG             0x78U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t not_used0                     : 1;
  uint8_t tag_cnt                       : 2;
  uint8_t tag_sensor                    : 5;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t tag_sensor                    : 5;
  uint8_t tag_cnt                       : 2;
  uint8_t not_used0                     : 1;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_fifo_data_out_tag_t;

#define LSM6DSV16BX_FIFO_DATA_OUT_BYTE_0          0x79U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t fifo_data_out                 : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t fifo_data_out                 : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_fifo_data_out_byte_0_t;

#define LSM6DSV16BX_FIFO_DATA_OUT_BYTE_1          0x7AU
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t fifo_data_out                 : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t fifo_data_out                 : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_fifo_data_out_byte_1_t;

#define LSM6DSV16BX_FIFO_DATA_OUT_BYTE_2          0x7BU
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t fifo_data_out                 : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t fifo_data_out                 : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_fifo_data_out_byte_2_t;

