stm32duino/LSM6DSV16BX/src/lsm6dsv16bx_reg.h
#define LSM6DSV16BX_FIFO_DATA_OUT_BYTE_3          0x7CU
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t fifo_data_out                 : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t fifo_data_out                 : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_fifo_data_out_byte_3_t;

#define LSM6DSV16BX_FIFO_DATA_OUT_BYTE_4          0x7DU
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t fifo_data_out                 : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t fifo_data_out                 : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_fifo_data_out_byte_4_t;

#define LSM6DSV16BX_FIFO_DATA_OUT_BYTE_5          0x7EU
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t fifo_data_out                 : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t fifo_data_out                 : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_fifo_data_out_byte_5_t;

/**
  * @}
  *
  */

/** @defgroup bitfields page embedded
  * @{
  *
  */

#define LSM6DSV16BX_PAGE_SEL                      0x2U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t not_used0                     : 4;
  uint8_t page_sel                      : 4;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t page_sel                      : 4;
  uint8_t not_used0                     : 4;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_page_sel_t;

#define LSM6DSV16BX_EMB_FUNC_EN_A                 0x4U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t not_used2                     : 1;
  uint8_t sflp_game_en                  : 1;
  uint8_t not_used0                     : 1;
  uint8_t pedo_en                       : 1;
  uint8_t tilt_en                       : 1;
  uint8_t sign_motion_en                : 1;
  uint8_t not_used1                     : 1;
  uint8_t mlc_before_fsm_en             : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t mlc_before_fsm_en             : 1;
  uint8_t not_used1                     : 1;
  uint8_t sign_motion_en                : 1;
  uint8_t tilt_en                       : 1;
  uint8_t pedo_en                       : 1;
  uint8_t not_used0                     : 1;
  uint8_t sflp_game_en                  : 1;
  uint8_t not_used2                     : 1;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_emb_func_en_a_t;

#define LSM6DSV16BX_EMB_FUNC_EN_B                 0x5U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t fsm_en                        : 1;
  uint8_t not_used0                     : 2;
  uint8_t fifo_compr_en                 : 1;
  uint8_t mlc_en                        : 1;
  uint8_t not_used1                     : 3;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used1                     : 3;
  uint8_t mlc_en                        : 1;
  uint8_t fifo_compr_en                 : 1;
  uint8_t not_used0                     : 2;
  uint8_t fsm_en                        : 1;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_emb_func_en_b_t;

#define LSM6DSV16BX_EMB_FUNC_EXEC_STATUS          0x7U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t emb_func_endop                : 1;
  uint8_t emb_func_exec_ovr             : 1;
  uint8_t not_used0                     : 6;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used0                     : 6;
  uint8_t emb_func_exec_ovr             : 1;
  uint8_t emb_func_endop                : 1;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_emb_func_exec_status_t;

#define LSM6DSV16BX_PAGE_ADDRESS                  0x8U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t page_addr                     : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t page_addr                     : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_page_address_t;

#define LSM6DSV16BX_PAGE_VALUE                    0x9U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t page_value                    : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t page_value                    : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_page_value_t;

#define LSM6DSV16BX_EMB_FUNC_INT1                 0x0AU
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t not_used0                     : 3;
  uint8_t int1_step_detector            : 1;
  uint8_t int1_tilt                     : 1;
  uint8_t int1_sig_mot                  : 1;
  uint8_t not_used1                     : 1;
  uint8_t int1_fsm_lc                   : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t int1_fsm_lc                   : 1;
  uint8_t not_used1                     : 1;
  uint8_t int1_sig_mot                  : 1;
  uint8_t int1_tilt                     : 1;
  uint8_t int1_step_detector            : 1;
  uint8_t not_used0                     : 3;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_emb_func_int1_t;

#define LSM6DSV16BX_FSM_INT1                      0x0BU
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t int1_fsm1                     : 1;
  uint8_t int1_fsm2                     : 1;
  uint8_t int1_fsm3                     : 1;
  uint8_t int1_fsm4                     : 1;
  uint8_t int1_fsm5                     : 1;
  uint8_t int1_fsm6                     : 1;
  uint8_t int1_fsm7                     : 1;
  uint8_t int1_fsm8                     : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t int1_fsm8                     : 1;
  uint8_t int1_fsm7                     : 1;
  uint8_t int1_fsm6                     : 1;
  uint8_t int1_fsm5                     : 1;
  uint8_t int1_fsm4                     : 1;
  uint8_t int1_fsm3                     : 1;
  uint8_t int1_fsm2                     : 1;
  uint8_t int1_fsm1                     : 1;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_fsm_int1_t;

#define LSM6DSV16BX_MLC_INT1                      0x0DU
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t int1_mlc1                     : 1;
  uint8_t int1_mlc2                     : 1;
  uint8_t int1_mlc3                     : 1;
  uint8_t int1_mlc4                     : 1;
  uint8_t not_used0                     : 4;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used0                     : 4;
  uint8_t int1_mlc4                     : 1;
  uint8_t int1_mlc3                     : 1;
  uint8_t int1_mlc2                     : 1;
  uint8_t int1_mlc1                     : 1;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_mlc_int1_t;

#define LSM6DSV16BX_EMB_FUNC_INT2                 0x0EU
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t not_used0                     : 3;
  uint8_t int2_step_detector            : 1;
  uint8_t int2_tilt                     : 1;
  uint8_t int2_sig_mot                  : 1;
  uint8_t not_used1                     : 1;
  uint8_t int2_fsm_lc                   : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t int2_fsm_lc                   : 1;
  uint8_t not_used1                     : 1;
  uint8_t int2_sig_mot                  : 1;
  uint8_t int2_tilt                     : 1;
  uint8_t int2_step_detector            : 1;
  uint8_t not_used0                     : 3;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_emb_func_int2_t;

#define LSM6DSV16BX_FSM_INT2                      0x0FU
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t int2_fsm1                     : 1;
  uint8_t int2_fsm2                     : 1;
  uint8_t int2_fsm3                     : 1;
  uint8_t int2_fsm4                     : 1;
  uint8_t int2_fsm5                     : 1;
  uint8_t int2_fsm6                     : 1;
  uint8_t int2_fsm7                     : 1;
  uint8_t int2_fsm8                     : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t int2_fsm8                     : 1;
  uint8_t int2_fsm7                     : 1;
  uint8_t int2_fsm6                     : 1;
  uint8_t int2_fsm5                     : 1;
  uint8_t int2_fsm4                     : 1;
  uint8_t int2_fsm3                     : 1;
  uint8_t int2_fsm2                     : 1;
  uint8_t int2_fsm1                     : 1;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_fsm_int2_t;

#define LSM6DSV16BX_MLC_INT2                      0x11U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t int2_mlc1                     : 1;
  uint8_t int2_mlc2                     : 1;
  uint8_t int2_mlc3                     : 1;
  uint8_t int2_mlc4                     : 1;
  uint8_t not_used0                     : 4;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used0                     : 4;
  uint8_t int2_mlc4                     : 1;
  uint8_t int2_mlc3                     : 1;
  uint8_t int2_mlc2                     : 1;
  uint8_t int2_mlc1                     : 1;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_mlc_int2_t;

#define LSM6DSV16BX_EMB_FUNC_STATUS               0x12U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t not_used0                     : 3;
  uint8_t is_step_det                   : 1;
  uint8_t is_tilt                       : 1;
  uint8_t is_sigmot                     : 1;
  uint8_t not_used1                     : 1;
  uint8_t is_fsm_lc                     : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t is_fsm_lc                     : 1;
  uint8_t not_used1                     : 1;
  uint8_t is_sigmot                     : 1;
  uint8_t is_tilt                       : 1;
  uint8_t is_step_det                   : 1;
  uint8_t not_used0                     : 3;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_emb_func_status_t;

