stm32duino/LSM6DSV16BX/src/lsm6dsv16bx_reg.h
#define LSM6DSV16BX_FSM_STATUS                    0x13U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t is_fsm1                       : 1;
  uint8_t is_fsm2                       : 1;
  uint8_t is_fsm3                       : 1;
  uint8_t is_fsm4                       : 1;
  uint8_t is_fsm5                       : 1;
  uint8_t is_fsm6                       : 1;
  uint8_t is_fsm7                       : 1;
  uint8_t is_fsm8                       : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t is_fsm8                       : 1;
  uint8_t is_fsm7                       : 1;
  uint8_t is_fsm6                       : 1;
  uint8_t is_fsm5                       : 1;
  uint8_t is_fsm4                       : 1;
  uint8_t is_fsm3                       : 1;
  uint8_t is_fsm2                       : 1;
  uint8_t is_fsm1                       : 1;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_fsm_status_t;

#define LSM6DSV16BX_MLC_STATUS                    0x15U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t is_mlc1                       : 1;
  uint8_t is_mlc2                       : 1;
  uint8_t is_mlc3                       : 1;
  uint8_t is_mlc4                       : 1;
  uint8_t not_used0                     : 4;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used0                     : 4;
  uint8_t is_mlc4                       : 1;
  uint8_t is_mlc3                       : 1;
  uint8_t is_mlc2                       : 1;
  uint8_t is_mlc1                       : 1;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_mlc_status_t;

#define LSM6DSV16BX_PAGE_RW                       0x17U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t not_used0                     : 5;
  uint8_t page_read                     : 1;
  uint8_t page_write                    : 1;
  uint8_t emb_func_lir                  : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t emb_func_lir                  : 1;
  uint8_t page_write                    : 1;
  uint8_t page_read                     : 1;
  uint8_t not_used0                     : 5;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_page_rw_t;

#define LSM6DSV16BX_EMB_FUNC_FIFO_EN_A            0x44U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t not_used0                     : 1;
  uint8_t sflp_game_fifo_en             : 1;
  uint8_t not_used1                     : 2;
  uint8_t sflp_gravity_fifo_en          : 1;
  uint8_t sflp_gbias_fifo_en            : 1;
  uint8_t step_counter_fifo_en          : 1;
  uint8_t mlc_fifo_en                   : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t mlc_fifo_en                   : 1;
  uint8_t step_counter_fifo_en          : 1;
  uint8_t sflp_gbias_fifo_en            : 1;
  uint8_t sflp_gravity_fifo_en          : 1;
  uint8_t not_used1                     : 2;
  uint8_t sflp_game_fifo_en             : 1;
  uint8_t not_used0                     : 1;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_emb_func_fifo_en_a_t;

#define LSM6DSV16BX_EMB_FUNC_FIFO_EN_B            0x45U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t not_used0                     : 1;
  uint8_t mlc_filter_feature_fifo_en    : 1;
  uint8_t not_used1                     : 6;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used1                     : 6;
  uint8_t mlc_filter_feature_fifo_en    : 1;
  uint8_t not_used0                     : 1;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_emb_func_fifo_en_b_t;

#define LSM6DSV16BX_FSM_ENABLE                    0x46U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t fsm1_en                       : 1;
  uint8_t fsm2_en                       : 1;
  uint8_t fsm3_en                       : 1;
  uint8_t fsm4_en                       : 1;
  uint8_t fsm5_en                       : 1;
  uint8_t fsm6_en                       : 1;
  uint8_t fsm7_en                       : 1;
  uint8_t fsm8_en                       : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t fsm8_en                       : 1;
  uint8_t fsm7_en                       : 1;
  uint8_t fsm6_en                       : 1;
  uint8_t fsm5_en                       : 1;
  uint8_t fsm4_en                       : 1;
  uint8_t fsm3_en                       : 1;
  uint8_t fsm2_en                       : 1;
  uint8_t fsm1_en                       : 1;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_fsm_enable_t;

#define LSM6DSV16BX_FSM_LONG_COUNTER_L            0x48U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t fsm_lc                        : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t fsm_lc                        : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_fsm_long_counter_l_t;

#define LSM6DSV16BX_FSM_LONG_COUNTER_H            0x49U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t fsm_lc                        : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t fsm_lc                        : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_fsm_long_counter_h_t;

#define LSM6DSV16BX_INT_ACK_MASK                  0x4BU
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t iack_mask                     : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t iack_mask                     : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_int_ack_mask_t;

#define LSM6DSV16BX_FSM_OUTS1                     0x4CU
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t fsm1_n_v                      : 1;
  uint8_t fsm1_p_v                      : 1;
  uint8_t fsm1_n_3                      : 1;
  uint8_t fsm1_p_3                      : 1;
  uint8_t fsm1_n_2                      : 1;
  uint8_t fsm1_p_2                      : 1;
  uint8_t fsm1_n_1                      : 1;
  uint8_t fsm1_p_1                      : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t fsm1_p_1                      : 1;
  uint8_t fsm1_n_1                      : 1;
  uint8_t fsm1_p_2                      : 1;
  uint8_t fsm1_n_2                      : 1;
  uint8_t fsm1_p_3                      : 1;
  uint8_t fsm1_n_3                      : 1;
  uint8_t fsm1_p_v                      : 1;
  uint8_t fsm1_n_v                      : 1;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_fsm_outs1_t;

#define LSM6DSV16BX_FSM_OUTS2                     0x4DU
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t fsm2_n_v                      : 1;
  uint8_t fsm2_p_v                      : 1;
  uint8_t fsm2_n_3                      : 1;
  uint8_t fsm2_p_3                      : 1;
  uint8_t fsm2_n_2                      : 1;
  uint8_t fsm2_p_2                      : 1;
  uint8_t fsm2_n_1                      : 1;
  uint8_t fsm2_p_1                      : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t fsm2_p_1                      : 1;
  uint8_t fsm2_n_1                      : 1;
  uint8_t fsm2_p_2                      : 1;
  uint8_t fsm2_n_2                      : 1;
  uint8_t fsm2_p_3                      : 1;
  uint8_t fsm2_n_3                      : 1;
  uint8_t fsm2_p_v                      : 1;
  uint8_t fsm2_n_v                      : 1;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_fsm_outs2_t;

#define LSM6DSV16BX_FSM_OUTS3                     0x4EU
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t fsm3_n_v                      : 1;
  uint8_t fsm3_p_v                      : 1;
  uint8_t fsm3_n_3                      : 1;
  uint8_t fsm3_p_3                      : 1;
  uint8_t fsm3_n_2                      : 1;
  uint8_t fsm3_p_2                      : 1;
  uint8_t fsm3_n_1                      : 1;
  uint8_t fsm3_p_1                      : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t fsm3_p_1                      : 1;
  uint8_t fsm3_n_1                      : 1;
  uint8_t fsm3_p_2                      : 1;
  uint8_t fsm3_n_2                      : 1;
  uint8_t fsm3_p_3                      : 1;
  uint8_t fsm3_n_3                      : 1;
  uint8_t fsm3_p_v                      : 1;
  uint8_t fsm3_n_v                      : 1;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_fsm_outs3_t;

#define LSM6DSV16BX_FSM_OUTS4                     0x4FU
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t fsm4_n_v                      : 1;
  uint8_t fsm4_p_v                      : 1;
  uint8_t fsm4_n_3                      : 1;
  uint8_t fsm4_p_3                      : 1;
  uint8_t fsm4_n_2                      : 1;
  uint8_t fsm4_p_2                      : 1;
  uint8_t fsm4_n_1                      : 1;
  uint8_t fsm4_p_1                      : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t fsm4_p_1                      : 1;
  uint8_t fsm4_n_1                      : 1;
  uint8_t fsm4_p_2                      : 1;
  uint8_t fsm4_n_2                      : 1;
  uint8_t fsm4_p_3                      : 1;
  uint8_t fsm4_n_3                      : 1;
  uint8_t fsm4_p_v                      : 1;
  uint8_t fsm4_n_v                      : 1;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_fsm_outs4_t;

#define LSM6DSV16BX_FSM_OUTS5                     0x50U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t fsm5_n_v                      : 1;
  uint8_t fsm5_p_v                      : 1;
  uint8_t fsm5_n_3                      : 1;
  uint8_t fsm5_p_3                      : 1;
  uint8_t fsm5_n_2                      : 1;
  uint8_t fsm5_p_2                      : 1;
  uint8_t fsm5_n_1                      : 1;
  uint8_t fsm5_p_1                      : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t fsm5_p_1                      : 1;
  uint8_t fsm5_n_1                      : 1;
  uint8_t fsm5_p_2                      : 1;
  uint8_t fsm5_n_2                      : 1;
  uint8_t fsm5_p_3                      : 1;
  uint8_t fsm5_n_3                      : 1;
  uint8_t fsm5_p_v                      : 1;
  uint8_t fsm5_n_v                      : 1;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_fsm_outs5_t;

#define LSM6DSV16BX_FSM_OUTS6                     0x51U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t fsm6_n_v                      : 1;
  uint8_t fsm6_p_v                      : 1;
  uint8_t fsm6_n_3                      : 1;
  uint8_t fsm6_p_3                      : 1;
  uint8_t fsm6_n_2                      : 1;
  uint8_t fsm6_p_2                      : 1;
  uint8_t fsm6_n_1                      : 1;
  uint8_t fsm6_p_1                      : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t fsm6_p_1                      : 1;
  uint8_t fsm6_n_1                      : 1;
  uint8_t fsm6_p_2                      : 1;
  uint8_t fsm6_n_2                      : 1;
  uint8_t fsm6_p_3                      : 1;
  uint8_t fsm6_n_3                      : 1;
  uint8_t fsm6_p_v                      : 1;
  uint8_t fsm6_n_v                      : 1;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_fsm_outs6_t;

#define LSM6DSV16BX_FSM_OUTS7                     0x52U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t fsm7_n_v                      : 1;
  uint8_t fsm7_p_v                      : 1;
  uint8_t fsm7_n_3                      : 1;
  uint8_t fsm7_p_3                      : 1;
  uint8_t fsm7_n_2                      : 1;
  uint8_t fsm7_p_2                      : 1;
  uint8_t fsm7_n_1                      : 1;
  uint8_t fsm7_p_1                      : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t fsm7_p_1                      : 1;
  uint8_t fsm7_n_1                      : 1;
  uint8_t fsm7_p_2                      : 1;
  uint8_t fsm7_n_2                      : 1;
  uint8_t fsm7_p_3                      : 1;
  uint8_t fsm7_n_3                      : 1;
  uint8_t fsm7_p_v                      : 1;
  uint8_t fsm7_n_v                      : 1;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_fsm_outs7_t;

