stm32duino/LSM6DSV16BX/src/lsm6dsv16bx_reg.h
#define LSM6DSV16BX_FSM_OUTS8                     0x53U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t fsm8_n_v                      : 1;
  uint8_t fsm8_p_v                      : 1;
  uint8_t fsm8_n_3                      : 1;
  uint8_t fsm8_p_3                      : 1;
  uint8_t fsm8_n_2                      : 1;
  uint8_t fsm8_p_2                      : 1;
  uint8_t fsm8_n_1                      : 1;
  uint8_t fsm8_p_1                      : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t fsm8_p_1                      : 1;
  uint8_t fsm8_n_1                      : 1;
  uint8_t fsm8_p_2                      : 1;
  uint8_t fsm8_n_2                      : 1;
  uint8_t fsm8_p_3                      : 1;
  uint8_t fsm8_n_3                      : 1;
  uint8_t fsm8_p_v                      : 1;
  uint8_t fsm8_n_v                      : 1;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_fsm_outs8_t;

#define LSM6DSV16BX_SFLP_ODR                      0x5EU
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t not_used0                     : 3;
  uint8_t sflp_game_odr                 : 3;
  uint8_t not_used1                     : 2;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used1                     : 2;
  uint8_t sflp_game_odr                 : 3;
  uint8_t not_used0                     : 3;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_sflp_odr_t;

#define LSM6DSV16BX_FSM_ODR                       0x5FU
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t not_used0                     : 3;
  uint8_t fsm_odr                       : 3;
  uint8_t not_used1                     : 2;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used1                     : 2;
  uint8_t fsm_odr                       : 3;
  uint8_t not_used0                     : 3;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_fsm_odr_t;

#define LSM6DSV16BX_MLC_ODR                       0x60U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t not_used0                     : 4;
  uint8_t mlc_odr                       : 3;
  uint8_t not_used1                     : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used1                     : 1;
  uint8_t mlc_odr                       : 3;
  uint8_t not_used0                     : 4;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_mlc_odr_t;

#define LSM6DSV16BX_STEP_COUNTER_L                0x62U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t step                          : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t step                          : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_step_counter_l_t;

#define LSM6DSV16BX_STEP_COUNTER_H                0x63U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t step                          : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t step                          : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_step_counter_h_t;

#define LSM6DSV16BX_EMB_FUNC_SRC                  0x64U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t not_used0                     : 2;
  uint8_t stepcounter_bit_set           : 1;
  uint8_t step_overflow                 : 1;
  uint8_t step_count_delta_ia           : 1;
  uint8_t step_detected                 : 1;
  uint8_t not_used1                     : 1;
  uint8_t pedo_rst_step                 : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t pedo_rst_step                 : 1;
  uint8_t not_used1                     : 1;
  uint8_t step_detected                 : 1;
  uint8_t step_count_delta_ia           : 1;
  uint8_t step_overflow                 : 1;
  uint8_t stepcounter_bit_set           : 1;
  uint8_t not_used0                     : 2;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_emb_func_src_t;

#define LSM6DSV16BX_EMB_FUNC_INIT_A               0x66U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t not_used0                     : 1;
  uint8_t sflp_game_init                : 1;
  uint8_t not_used2                     : 1;
  uint8_t step_det_init                 : 1;
  uint8_t tilt_init                     : 1;
  uint8_t sig_mot_init                  : 1;
  uint8_t not_used1                     : 1;
  uint8_t mlc_before_fsm_init           : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t mlc_before_fsm_init           : 1;
  uint8_t not_used1                     : 1;
  uint8_t sig_mot_init                  : 1;
  uint8_t tilt_init                     : 1;
  uint8_t step_det_init                 : 1;
  uint8_t not_used2                     : 1;
  uint8_t sflp_game_init                : 1;
  uint8_t not_used0                     : 1;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_emb_func_init_a_t;

#define LSM6DSV16BX_EMB_FUNC_INIT_B               0x67U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t fsm_init                      : 1;
  uint8_t not_used0                     : 2;
  uint8_t fifo_compr_init               : 1;
  uint8_t mlc_init                      : 1;
  uint8_t not_used1                     : 3;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used1                     : 3;
  uint8_t mlc_init                      : 1;
  uint8_t fifo_compr_init               : 1;
  uint8_t not_used0                     : 2;
  uint8_t fsm_init                      : 1;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_emb_func_init_b_t;

#define LSM6DSV16BX_MLC1_SRC                      0x70U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t mlc1_src                      : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t mlc1_src                      : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_mlc1_src_t;

#define LSM6DSV16BX_MLC2_SRC                      0x71U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t mlc2_src                      : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t mlc2_src                      : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_mlc2_src_t;

#define LSM6DSV16BX_MLC3_SRC                      0x72U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t mlc3_src                      : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t mlc3_src                      : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_mlc3_src_t;

#define LSM6DSV16BX_MLC4_SRC                      0x73U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t mlc4_src                      : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t mlc4_src                      : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_mlc4_src_t;

/**
  * @}
  *
  */

/** @defgroup bitfields page pg0_emb_adv
  * @{
  *
  */
#define LSM6DSV16BX_EMB_ADV_PG_0                  0x000

#define LSM6DSV16BX_SFLP_GAME_GBIASX_L            0x6EU
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t gbiasx                        : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t gbiasx                        : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_sflp_game_gbiasx_l_t;

#define LSM6DSV16BX_SFLP_GAME_GBIASX_H            0x6FU
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t gbiasx                        : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t gbiasx                        : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_sflp_game_gbiasx_h_t;

