stm32duino/LSM6DSV16BX/src/lsm6dsv16bx_reg.h
#define LSM6DSV16BX_SFLP_GAME_GBIASY_L            0x70U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t gbiasy                        : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t gbiasy                        : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_sflp_game_gbiasy_l_t;

#define LSM6DSV16BX_SFLP_GAME_GBIASY_H            0x71U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t gbiasy                        : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t gbiasy                        : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_sflp_game_gbiasy_h_t;

#define LSM6DSV16BX_SFLP_GAME_GBIASZ_L            0x72U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t gbiasz                        : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t gbiasz                        : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_sflp_game_gbiasz_l_t;

#define LSM6DSV16BX_SFLP_GAME_GBIASZ_H            0x73U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t gbiasz                        : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t gbiasz                        : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_sflp_game_gbiasz_h_t;

#define LSM6DSV16BX_FSM_QVAR_SENSITIVITY_L        0xBAU
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t fsm_qvar_s                    : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t fsm_qvar_s                    : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_fsm_qvar_sensitivity_l_t;

#define LSM6DSV16BX_FSM_QVAR_SENSITIVITY_H        0xBBU
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t fsm_qvar_s                    : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t fsm_qvar_s                    : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_fsm_qvar_sensitivity_h_t;

/**
  * @}
  *
  */

/** @defgroup bitfields page pg1_emb_adv
  * @{
  *
  */

#define LSM6DSV16BX_EMB_ADV_PG_1                  0x001

#define LSM6DSV16BX_FSM_LC_TIMEOUT_L              0x17AU
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t fsm_lc_timeout                : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t fsm_lc_timeout                : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_fsm_lc_timeout_l_t;

#define LSM6DSV16BX_FSM_LC_TIMEOUT_H              0x17BU
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t fsm_lc_timeout                : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t fsm_lc_timeout                : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_fsm_lc_timeout_h_t;

#define LSM6DSV16BX_FSM_PROGRAMS                  0x17CU
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t fsm_n_prog                    : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t fsm_n_prog                    : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_fsm_programs_t;

#define LSM6DSV16BX_FSM_START_ADD_L               0x17EU
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t fsm_start                     : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t fsm_start                     : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_fsm_start_add_l_t;

#define LSM6DSV16BX_FSM_START_ADD_H               0x17FU
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t fsm_start                     : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t fsm_start                     : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_fsm_start_add_h_t;

#define LSM6DSV16BX_PEDO_CMD_REG                  0x183U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t not_used0                     : 2;
  uint8_t fp_rejection_en               : 1;
  uint8_t carry_count_en                : 1;
  uint8_t not_used1                     : 4;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used1                     : 4;
  uint8_t carry_count_en                : 1;
  uint8_t fp_rejection_en               : 1;
  uint8_t not_used0                     : 2;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_pedo_cmd_reg_t;

#define LSM6DSV16BX_PEDO_DEB_STEPS_CONF           0x184U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t deb_step                      : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t deb_step                      : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_pedo_deb_steps_conf_t;

#define LSM6DSV16BX_PEDO_SC_DELTAT_L              0x1D0U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t pd_sc                         : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t pd_sc                         : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_pedo_sc_deltat_l_t;

#define LSM6DSV16BX_PEDO_SC_DELTAT_H              0x1D1U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t pd_sc                         : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t pd_sc                         : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_pedo_sc_deltat_h_t;

#define LSM6DSV16BX_MLC_QVAR_SENSITIVITY_L        0x1E8U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t mlc_qvar_s                    : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t mlc_qvar_s                    : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_mlc_qvar_sensitivity_l_t;

#define LSM6DSV16BX_MLC_QVAR_SENSITIVITY_H        0x1E9U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t mlc_qvar_s                    : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t mlc_qvar_s                    : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv16bx_mlc_qvar_sensitivity_h_t;

/**
  * @}
  *
  */

#define LSM6DSV16BX_START_FSM_ADD                0x035CU

/**
  * @defgroup LSM6DSV16BX_Register_Union
  * @brief    These unions group all the registers having a bit-field
  *           description.
  *           These unions are useful but it's not needed by the driver.
  *
  *           REMOVING this unions you are compliant with:
  *           MISRA-C 2012 [Rule 19.2] -> " Union are not allowed "
  *
  * @{
  *
  */
typedef union {
  lsm6dsv16bx_func_cfg_access_t    func_cfg_access;
  lsm6dsv16bx_pin_ctrl_t    pin_ctrl;
  lsm6dsv16bx_if_cfg_t    if_cfg;
  lsm6dsv16bx_fifo_ctrl1_t    fifo_ctrl1;
  lsm6dsv16bx_fifo_ctrl2_t    fifo_ctrl2;
  lsm6dsv16bx_fifo_ctrl3_t    fifo_ctrl3;
  lsm6dsv16bx_fifo_ctrl4_t    fifo_ctrl4;
  lsm6dsv16bx_counter_bdr_reg1_t    counter_bdr_reg1;
  lsm6dsv16bx_counter_bdr_reg2_t    counter_bdr_reg2;
  lsm6dsv16bx_int1_ctrl_t    int1_ctrl;
  lsm6dsv16bx_int2_ctrl_t    int2_ctrl;
  lsm6dsv16bx_who_am_i_t    who_am_i;
  lsm6dsv16bx_ctrl1_t    ctrl1;
  lsm6dsv16bx_ctrl2_t    ctrl2;
  lsm6dsv16bx_ctrl3_t    ctrl3;
  lsm6dsv16bx_ctrl4_t    ctrl4;
  lsm6dsv16bx_ctrl5_t    ctrl5;
  lsm6dsv16bx_ctrl6_t    ctrl6;
  lsm6dsv16bx_ctrl7_t    ctrl7;
  lsm6dsv16bx_ctrl8_t    ctrl8;
  lsm6dsv16bx_ctrl9_t    ctrl9;
  lsm6dsv16bx_ctrl10_t    ctrl10;
  lsm6dsv16bx_fifo_status1_t    fifo_status1;
  lsm6dsv16bx_fifo_status2_t    fifo_status2;
  lsm6dsv16bx_all_int_src_t    all_int_src;
  lsm6dsv16bx_status_reg_t    status_reg;
  lsm6dsv16bx_out_temp_l_t    out_temp_l;
  lsm6dsv16bx_out_temp_h_t    out_temp_h;
  lsm6dsv16bx_outx_l_g_t    outx_l_g;
  lsm6dsv16bx_outx_h_g_t    outx_h_g;
  lsm6dsv16bx_outy_l_g_t    outy_l_g;
  lsm6dsv16bx_outy_h_g_t    outy_h_g;
  lsm6dsv16bx_outz_l_g_t    outz_l_g;
  lsm6dsv16bx_outz_h_g_t    outz_h_g;
  lsm6dsv16bx_outz_l_a_t    outz_l_a;
  lsm6dsv16bx_outz_h_a_t    outz_h_a;
  lsm6dsv16bx_outy_l_a_t    outy_l_a;
  lsm6dsv16bx_outy_h_a_t    outy_h_a;
  lsm6dsv16bx_outx_l_a_t    outx_l_a;
  lsm6dsv16bx_outx_h_a_t    outx_h_a;
  lsm6dsv16bx_ui_outz_l_a_dualc_t    ui_outz_l_a_dualc;
  lsm6dsv16bx_ui_outz_h_a_dualc_t    ui_outz_h_a_dualc;
  lsm6dsv16bx_ui_outy_l_a_dualc_t    ui_outy_l_a_dualc;
  lsm6dsv16bx_ui_outy_h_a_dualc_t    ui_outy_h_a_dualc;
  lsm6dsv16bx_ui_outx_l_a_dualc_t    ui_outx_l_a_dualc;
  lsm6dsv16bx_ui_outx_h_a_dualc_t    ui_outx_h_a_dualc;
  lsm6dsv16bx_ah_qvar_out_l_t    ah_qvar_out_l;
  lsm6dsv16bx_ah_qvar_out_h_t    ah_qvar_out_h;
  lsm6dsv16bx_timestamp0_t    timestamp0;
  lsm6dsv16bx_timestamp1_t    timestamp1;
  lsm6dsv16bx_timestamp2_t    timestamp2;
  lsm6dsv16bx_timestamp3_t    timestamp3;
  lsm6dsv16bx_wake_up_src_t    wake_up_src;
  lsm6dsv16bx_tap_src_t    tap_src;
  lsm6dsv16bx_d6d_src_t    d6d_src;
  lsm6dsv16bx_emb_func_status_mainpage_t    emb_func_status_mainpage;
  lsm6dsv16bx_fsm_status_mainpage_t    fsm_status_mainpage;
  lsm6dsv16bx_mlc_status_mainpage_t    mlc_status_mainpage;
  lsm6dsv16bx_internal_freq_t    internal_freq;
  lsm6dsv16bx_functions_enable_t    functions_enable;
  lsm6dsv16bx_inactivity_dur_t    inactivity_dur;
  lsm6dsv16bx_inactivity_ths_t    inactivity_ths;
  lsm6dsv16bx_tap_cfg0_t    tap_cfg0;
  lsm6dsv16bx_tap_cfg1_t    tap_cfg1;
  lsm6dsv16bx_tap_cfg2_t    tap_cfg2;
  lsm6dsv16bx_tap_ths_6d_t    tap_ths_6d;
  lsm6dsv16bx_tap_dur_t    int_dur2;
  lsm6dsv16bx_wake_up_ths_t    wake_up_ths;
  lsm6dsv16bx_wake_up_dur_t    wake_up_dur;
  lsm6dsv16bx_free_fall_t    free_fall;
  lsm6dsv16bx_md1_cfg_t    md1_cfg;
  lsm6dsv16bx_md2_cfg_t    md2_cfg;
  lsm6dsv16bx_emb_func_cfg_t    emb_func_cfg;
  lsm6dsv16bx_tdm_cfg0_t    tdm_cfg0;
  lsm6dsv16bx_tdm_cfg1_t    tdm_cfg1;
  lsm6dsv16bx_tdm_cfg2_t    tdm_cfg2;
  lsm6dsv16bx_z_ofs_usr_t    z_ofs_usr;
  lsm6dsv16bx_y_ofs_usr_t    y_ofs_usr;
  lsm6dsv16bx_x_ofs_usr_t    x_ofs_usr;
  lsm6dsv16bx_fifo_data_out_tag_t    fifo_data_out_tag;
  lsm6dsv16bx_fifo_data_out_byte_0_t    fifo_data_out_byte_0;
  lsm6dsv16bx_fifo_data_out_byte_1_t    fifo_data_out_byte_1;
  lsm6dsv16bx_fifo_data_out_byte_2_t    fifo_data_out_byte_2;
  lsm6dsv16bx_fifo_data_out_byte_3_t    fifo_data_out_byte_3;
  lsm6dsv16bx_fifo_data_out_byte_4_t    fifo_data_out_byte_4;
  lsm6dsv16bx_fifo_data_out_byte_5_t    fifo_data_out_byte_5;
  lsm6dsv16bx_page_sel_t    page_sel;
  lsm6dsv16bx_emb_func_en_a_t    emb_func_en_a;
  lsm6dsv16bx_emb_func_en_b_t    emb_func_en_b;
  lsm6dsv16bx_emb_func_exec_status_t    emb_func_exec_status;
  lsm6dsv16bx_page_address_t    page_address;
  lsm6dsv16bx_page_value_t    page_value;
  lsm6dsv16bx_emb_func_int1_t    emb_func_int1;
  lsm6dsv16bx_fsm_int1_t    fsm_int1;
  lsm6dsv16bx_mlc_int1_t    mlc_int1;
  lsm6dsv16bx_emb_func_int2_t    emb_func_int2;
  lsm6dsv16bx_fsm_int2_t    fsm_int2;
  lsm6dsv16bx_mlc_int2_t    mlc_int2;
  lsm6dsv16bx_emb_func_status_t    emb_func_status;
  lsm6dsv16bx_fsm_status_t    fsm_status;
  lsm6dsv16bx_mlc_status_t    mlc_status;
  lsm6dsv16bx_page_rw_t    page_rw;
  lsm6dsv16bx_emb_func_fifo_en_a_t    emb_func_fifo_en_a;
  lsm6dsv16bx_emb_func_fifo_en_b_t    emb_func_fifo_en_b;
  lsm6dsv16bx_fsm_enable_t    fsm_enable;
  lsm6dsv16bx_fsm_long_counter_l_t    fsm_long_counter_l;
  lsm6dsv16bx_fsm_long_counter_h_t    fsm_long_counter_h;
  lsm6dsv16bx_fsm_outs1_t    fsm_outs1;
  lsm6dsv16bx_fsm_outs2_t    fsm_outs2;
  lsm6dsv16bx_fsm_outs3_t    fsm_outs3;
  lsm6dsv16bx_fsm_outs4_t    fsm_outs4;
  lsm6dsv16bx_fsm_outs5_t    fsm_outs5;
  lsm6dsv16bx_fsm_outs6_t    fsm_outs6;
  lsm6dsv16bx_fsm_outs7_t    fsm_outs7;
  lsm6dsv16bx_fsm_outs8_t    fsm_outs8;
  lsm6dsv16bx_fsm_odr_t    fsm_odr;
  lsm6dsv16bx_mlc_odr_t    mlc_odr;
  lsm6dsv16bx_step_counter_l_t    step_counter_l;
  lsm6dsv16bx_step_counter_h_t    step_counter_h;
  lsm6dsv16bx_emb_func_src_t    emb_func_src;
  lsm6dsv16bx_emb_func_init_a_t    emb_func_init_a;
  lsm6dsv16bx_emb_func_init_b_t    emb_func_init_b;
  lsm6dsv16bx_mlc1_src_t    mlc1_src;
  lsm6dsv16bx_mlc2_src_t    mlc2_src;
  lsm6dsv16bx_mlc3_src_t    mlc3_src;
  lsm6dsv16bx_mlc4_src_t    mlc4_src;
  lsm6dsv16bx_fsm_qvar_sensitivity_l_t    fsm_qvar_sensitivity_l;
  lsm6dsv16bx_fsm_qvar_sensitivity_h_t    fsm_qvar_sensitivity_h;
  lsm6dsv16bx_fsm_lc_timeout_l_t    fsm_lc_timeout_l;
  lsm6dsv16bx_fsm_lc_timeout_h_t    fsm_lc_timeout_h;
  lsm6dsv16bx_fsm_programs_t    fsm_programs;
  lsm6dsv16bx_fsm_start_add_l_t    fsm_start_add_l;
  lsm6dsv16bx_fsm_start_add_h_t    fsm_start_add_h;
  lsm6dsv16bx_pedo_cmd_reg_t    pedo_cmd_reg;
  lsm6dsv16bx_pedo_deb_steps_conf_t    pedo_deb_steps_conf;
  lsm6dsv16bx_pedo_sc_deltat_l_t    pedo_sc_deltat_l;
  lsm6dsv16bx_pedo_sc_deltat_h_t    pedo_sc_deltat_h;
  lsm6dsv16bx_mlc_qvar_sensitivity_l_t    mlc_qvar_sensitivity_l;
  lsm6dsv16bx_mlc_qvar_sensitivity_h_t    mlc_qvar_sensitivity_h;
  bitwise_t    bitwise;
  uint8_t    byte;
} lsm6dsv16bx_reg_t;


/**
  * @}
  *
  */

#ifndef __weak
#define __weak __attribute__((weak))
#endif /* __weak */

