stm32duino/LSM6DSV16BX/src/lsm6dsv16bx_reg.h
/*
 * These are the basic platform dependent I/O routines to read
 * and write device registers connected on a standard bus.
 * The driver keeps offering a default implementation based on function
 * pointers to read/write routines for backward compatibility.
 * The __weak directive allows the final application to overwrite
 * them with a custom implementation.
 */

int32_t lsm6dsv16bx_read_reg(const stmdev_ctx_t *ctx, uint8_t reg,
                             uint8_t *data,
                             uint16_t len);
int32_t lsm6dsv16bx_write_reg(const stmdev_ctx_t *ctx, uint8_t reg,
                              uint8_t *data,
                              uint16_t len);

float_t lsm6dsv16bx_from_sflp_to_mg(int16_t lsb);
float_t lsm6dsv16bx_from_fs2_to_mg(int16_t lsb);
float_t lsm6dsv16bx_from_fs4_to_mg(int16_t lsb);
float_t lsm6dsv16bx_from_fs8_to_mg(int16_t lsb);
float_t lsm6dsv16bx_from_fs16_to_mg(int16_t lsb);

float_t lsm6dsv16bx_from_fs125_to_mdps(int16_t lsb);
float_t lsm6dsv16bx_from_fs500_to_mdps(int16_t lsb);
float_t lsm6dsv16bx_from_fs250_to_mdps(int16_t lsb);
float_t lsm6dsv16bx_from_fs1000_to_mdps(int16_t lsb);
float_t lsm6dsv16bx_from_fs2000_to_mdps(int16_t lsb);
float_t lsm6dsv16bx_from_fs4000_to_mdps(int16_t lsb);

float_t lsm6dsv16bx_from_lsb_to_celsius(int16_t lsb);

uint64_t lsm6dsv16bx_from_lsb_to_nsec(uint32_t lsb);

float_t lsm6dsv16bx_from_lsb_to_mv(int16_t lsb);

typedef enum {
  LSM6DSV16BX_READY                               = 0x0,
  LSM6DSV16BX_GLOBAL_RST                          = 0x1,
  LSM6DSV16BX_RESTORE_CAL_PARAM                   = 0x2,
  LSM6DSV16BX_RESTORE_CTRL_REGS                   = 0x4,
} lsm6dsv16bx_reset_t;
int32_t lsm6dsv16bx_reset_set(const stmdev_ctx_t *ctx, lsm6dsv16bx_reset_t val);
int32_t lsm6dsv16bx_reset_get(const stmdev_ctx_t *ctx, lsm6dsv16bx_reset_t *val);

typedef enum {
  LSM6DSV16BX_MAIN_MEM_BANK                       = 0x0,
  LSM6DSV16BX_EMBED_FUNC_MEM_BANK                 = 0x1,
} lsm6dsv16bx_mem_bank_t;
int32_t lsm6dsv16bx_mem_bank_set(const stmdev_ctx_t *ctx, lsm6dsv16bx_mem_bank_t val);
int32_t lsm6dsv16bx_mem_bank_get(const stmdev_ctx_t *ctx,
                                 lsm6dsv16bx_mem_bank_t *val);

int32_t lsm6dsv16bx_device_id_get(const stmdev_ctx_t *ctx, uint8_t *val);

typedef enum {
  LSM6DSV16BX_XL_ODR_OFF                          = 0x0,
  LSM6DSV16BX_XL_ODR_AT_1Hz875                    = 0x1,
  LSM6DSV16BX_XL_ODR_AT_7Hz5                      = 0x2,
  LSM6DSV16BX_XL_ODR_AT_15Hz                      = 0x3,
  LSM6DSV16BX_XL_ODR_AT_30Hz                      = 0x4,
  LSM6DSV16BX_XL_ODR_AT_60Hz                      = 0x5,
  LSM6DSV16BX_XL_ODR_AT_120Hz                     = 0x6,
  LSM6DSV16BX_XL_ODR_AT_240Hz                     = 0x7,
  LSM6DSV16BX_XL_ODR_AT_480Hz                     = 0x8,
  LSM6DSV16BX_XL_ODR_AT_960Hz                     = 0x9,
  LSM6DSV16BX_XL_ODR_AT_1920Hz                    = 0xA,
  LSM6DSV16BX_XL_ODR_AT_3840Hz                    = 0xB,
  LSM6DSV16BX_XL_ODR_AT_7680Hz                    = 0xC,
} lsm6dsv16bx_xl_data_rate_t;
int32_t lsm6dsv16bx_xl_data_rate_set(const stmdev_ctx_t *ctx,
                                     lsm6dsv16bx_xl_data_rate_t val);
int32_t lsm6dsv16bx_xl_data_rate_get(const stmdev_ctx_t *ctx,
                                     lsm6dsv16bx_xl_data_rate_t *val);

typedef enum {
  LSM6DSV16BX_XL_HIGH_PERFORMANCE_MD              = 0x0,
  LSM6DSV16BX_XL_HIGH_PERFORMANCE_TDM_MD          = 0x2,
  LSM6DSV16BX_XL_LOW_POWER_2_AVG_MD               = 0x4,
  LSM6DSV16BX_XL_LOW_POWER_4_AVG_MD               = 0x5,
  LSM6DSV16BX_XL_LOW_POWER_8_AVG_MD               = 0x6,
} lsm6dsv16bx_xl_mode_t;
int32_t lsm6dsv16bx_xl_mode_set(const stmdev_ctx_t *ctx, lsm6dsv16bx_xl_mode_t val);
int32_t lsm6dsv16bx_xl_mode_get(const stmdev_ctx_t *ctx, lsm6dsv16bx_xl_mode_t *val);

typedef enum {
  LSM6DSV16BX_GY_ODR_OFF                          = 0x0,
  LSM6DSV16BX_GY_ODR_AT_7Hz5                      = 0x2,
  LSM6DSV16BX_GY_ODR_AT_15Hz                      = 0x3,
  LSM6DSV16BX_GY_ODR_AT_30Hz                      = 0x4,
  LSM6DSV16BX_GY_ODR_AT_60Hz                      = 0x5,
  LSM6DSV16BX_GY_ODR_AT_120Hz                     = 0x6,
  LSM6DSV16BX_GY_ODR_AT_240Hz                     = 0x7,
  LSM6DSV16BX_GY_ODR_AT_480Hz                     = 0x8,
  LSM6DSV16BX_GY_ODR_AT_960Hz                     = 0x9,
  LSM6DSV16BX_GY_ODR_AT_1920Hz                    = 0xa,
  LSM6DSV16BX_GY_ODR_AT_3840Hz                    = 0xb,
  LSM6DSV16BX_GY_ODR_AT_7680Hz                    = 0xc,
} lsm6dsv16bx_gy_data_rate_t;
int32_t lsm6dsv16bx_gy_data_rate_set(const stmdev_ctx_t *ctx,
                                     lsm6dsv16bx_gy_data_rate_t val);
int32_t lsm6dsv16bx_gy_data_rate_get(const stmdev_ctx_t *ctx,
                                     lsm6dsv16bx_gy_data_rate_t *val);

typedef enum {
  LSM6DSV16BX_GY_HIGH_PERFORMANCE_MD              = 0x0,
  LSM6DSV16BX_GY_SLEEP_MD                         = 0x4,
  LSM6DSV16BX_GY_LOW_POWER_MD                     = 0x5,
} lsm6dsv16bx_gy_mode_t;
int32_t lsm6dsv16bx_gy_mode_set(const stmdev_ctx_t *ctx, lsm6dsv16bx_gy_mode_t val);
int32_t lsm6dsv16bx_gy_mode_get(const stmdev_ctx_t *ctx, lsm6dsv16bx_gy_mode_t *val);

int32_t lsm6dsv16bx_auto_increment_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsv16bx_auto_increment_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsv16bx_block_data_update_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsv16bx_block_data_update_get(const stmdev_ctx_t *ctx, uint8_t *val);

typedef enum {
  LSM6DSV16BX_DRDY_LATCHED                        = 0x0,
  LSM6DSV16BX_DRDY_PULSED                         = 0x1,
} lsm6dsv16bx_data_ready_mode_t;
int32_t lsm6dsv16bx_data_ready_mode_set(const stmdev_ctx_t *ctx,
                                        lsm6dsv16bx_data_ready_mode_t val);
int32_t lsm6dsv16bx_data_ready_mode_get(const stmdev_ctx_t *ctx,
                                        lsm6dsv16bx_data_ready_mode_t *val);

typedef enum {
  LSM6DSV16BX_125dps                              = 0x0,
  LSM6DSV16BX_250dps                              = 0x1,
  LSM6DSV16BX_500dps                              = 0x2,
  LSM6DSV16BX_1000dps                             = 0x3,
  LSM6DSV16BX_2000dps                             = 0x4,
  LSM6DSV16BX_4000dps                             = 0xc,
} lsm6dsv16bx_gy_full_scale_t;
