stm32duino/LSM6DSV16BX/src/lsm6dsv16bx_reg.h
int32_t lsm6dsv16bx_gy_full_scale_set(const stmdev_ctx_t *ctx,
                                      lsm6dsv16bx_gy_full_scale_t val);
int32_t lsm6dsv16bx_gy_full_scale_get(const stmdev_ctx_t *ctx,
                                      lsm6dsv16bx_gy_full_scale_t *val);

typedef enum {
  LSM6DSV16BX_2g                                  = 0x0,
  LSM6DSV16BX_4g                                  = 0x1,
  LSM6DSV16BX_8g                                  = 0x2,
  LSM6DSV16BX_16g                                 = 0x3,
} lsm6dsv16bx_xl_full_scale_t;
int32_t lsm6dsv16bx_xl_full_scale_set(const stmdev_ctx_t *ctx,
                                      lsm6dsv16bx_xl_full_scale_t val);
int32_t lsm6dsv16bx_xl_full_scale_get(const stmdev_ctx_t *ctx,
                                      lsm6dsv16bx_xl_full_scale_t *val);

int32_t lsm6dsv16bx_xl_dual_channel_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsv16bx_xl_dual_channel_get(const stmdev_ctx_t *ctx, uint8_t *val);

typedef enum {
  LSM6DSV16BX_XL_ST_DISABLE                       = 0x0,
  LSM6DSV16BX_XL_ST_POSITIVE                      = 0x1,
  LSM6DSV16BX_XL_ST_NEGATIVE                      = 0x2,
  LSM6DSV16BX_XL_ST_OFFSET_POS                    = 0x5,
  LSM6DSV16BX_XL_ST_OFFSET_NEG                    = 0x6,
} lsm6dsv16bx_xl_self_test_t;
int32_t lsm6dsv16bx_xl_self_test_set(const stmdev_ctx_t *ctx,
                                     lsm6dsv16bx_xl_self_test_t val);
int32_t lsm6dsv16bx_xl_self_test_get(const stmdev_ctx_t *ctx,
                                     lsm6dsv16bx_xl_self_test_t *val);

typedef enum {
  LSM6DSV16BX_GY_ST_DISABLE                       = 0x0,
  LSM6DSV16BX_GY_ST_POSITIVE                      = 0x1,
  LSM6DSV16BX_GY_ST_NEGATIVE                      = 0x2,
} lsm6dsv16bx_gy_self_test_t;
int32_t lsm6dsv16bx_gy_self_test_set(const stmdev_ctx_t *ctx,
                                     lsm6dsv16bx_gy_self_test_t val);
int32_t lsm6dsv16bx_gy_self_test_get(const stmdev_ctx_t *ctx,
                                     lsm6dsv16bx_gy_self_test_t *val);

typedef struct {
  uint8_t drdy_xl                       : 1;
  uint8_t drdy_gy                       : 1;
  uint8_t drdy_temp                     : 1;
  uint8_t drdy_ah_qvar                  : 1;
  uint8_t gy_settling                   : 1;
  uint8_t den_flag                      : 1;
  uint8_t timestamp                     : 1;
  uint8_t free_fall                     : 1;
  uint8_t wake_up                       : 1;
  uint8_t wake_up_z                     : 1;
  uint8_t wake_up_y                     : 1;
  uint8_t wake_up_x                     : 1;
  uint8_t single_tap                    : 1;
  uint8_t double_tap                    : 1;
  uint8_t tap_z                         : 1;
  uint8_t tap_y                         : 1;
  uint8_t tap_x                         : 1;
  uint8_t tap_sign                      : 1;
  uint8_t six_d                         : 1;
  uint8_t six_d_xl                      : 1;
  uint8_t six_d_xh                      : 1;
  uint8_t six_d_yl                      : 1;
  uint8_t six_d_yh                      : 1;
  uint8_t six_d_zl                      : 1;
  uint8_t six_d_zh                      : 1;
  uint8_t sleep_change                  : 1;
  uint8_t sleep_state                   : 1;
  uint8_t step_detector                 : 1;
  uint8_t step_count_inc                : 1;
  uint8_t step_count_overflow           : 1;
  uint8_t step_on_delta_time            : 1;
  uint8_t emb_func_stand_by             : 1;
  uint8_t emb_func_time_exceed: 1;
  uint8_t tilt                          : 1;
  uint8_t sig_mot                       : 1;
  uint8_t fsm_lc                        : 1;
  uint8_t fsm1                          : 1;
  uint8_t fsm2                          : 1;
  uint8_t fsm3                          : 1;
  uint8_t fsm4                          : 1;
  uint8_t fsm5                          : 1;
  uint8_t fsm6                          : 1;
  uint8_t fsm7                          : 1;
  uint8_t fsm8                          : 1;
  uint8_t mlc1                          : 1;
  uint8_t mlc2                          : 1;
  uint8_t mlc3                          : 1;
  uint8_t mlc4                          : 1;
  uint8_t fifo_bdr                      : 1;
  uint8_t fifo_full                     : 1;
  uint8_t fifo_ovr                      : 1;
  uint8_t fifo_th                       : 1;
} lsm6dsv16bx_all_sources_t;
int32_t lsm6dsv16bx_all_sources_get(const stmdev_ctx_t *ctx,
                                    lsm6dsv16bx_all_sources_t *val);

typedef struct {
  uint8_t drdy_xl                       : 1;
  uint8_t drdy_gy                       : 1;
  uint8_t drdy_temp                     : 1;
  uint8_t drdy_ah_qvar                  : 1;
} lsm6dsv16bx_data_ready_t;
int32_t lsm6dsv16bx_flag_data_ready_get(const stmdev_ctx_t *ctx,
                                        lsm6dsv16bx_data_ready_t *val);

int32_t lsm6dsv16bx_temperature_raw_get(const stmdev_ctx_t *ctx, int16_t *val);

int32_t lsm6dsv16bx_angular_rate_raw_get(const stmdev_ctx_t *ctx, int16_t *val);

int32_t lsm6dsv16bx_acceleration_raw_get(const stmdev_ctx_t *ctx, int16_t *val);

int32_t lsm6dsv16bx_dual_acceleration_raw_get(const stmdev_ctx_t *ctx, int16_t *val);

int32_t lsm6dsv16bx_dual_acceleration_raw_get(const stmdev_ctx_t *ctx,
                                              int16_t *val);

int32_t lsm6dsv16bx_ah_qvar_raw_get(const stmdev_ctx_t *ctx, int16_t *val);

int32_t lsm6dsv16bx_odr_cal_reg_get(const stmdev_ctx_t *ctx, int8_t *val);

typedef struct {
  uint8_t x                             : 1;
  uint8_t y                             : 1;
  uint8_t z                             : 1;
} lsm6dsv16bx_tdm_xl_axis_t;
int32_t lsm6dsv16bx_tdm_xl_axis_set(const stmdev_ctx_t *ctx, lsm6dsv16bx_tdm_xl_axis_t val);
int32_t lsm6dsv16bx_tdm_xl_axis_get(const stmdev_ctx_t *ctx, lsm6dsv16bx_tdm_xl_axis_t *val);

int32_t lsm6dsv16bx_ln_pg_write(const stmdev_ctx_t *ctx, uint16_t address,
                                uint8_t *buf, uint8_t len);
int32_t lsm6dsv16bx_ln_pg_read(const stmdev_ctx_t *ctx, uint16_t address,
                               uint8_t *buf, uint8_t len);

