stm32duino/LSM6DSV16BX/src/lsm6dsv16bx_reg.h
int32_t lsm6dsv16bx_timestamp_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsv16bx_timestamp_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsv16bx_timestamp_raw_get(const stmdev_ctx_t *ctx, uint32_t *val);

typedef enum {
  LSM6DSV16BX_AUTO                                = 0x0,
  LSM6DSV16BX_ALWAYS_ACTIVE                       = 0x1,
} lsm6dsv16bx_filt_anti_spike_t;
int32_t lsm6dsv16bx_filt_anti_spike_set(const stmdev_ctx_t *ctx,
                                        lsm6dsv16bx_filt_anti_spike_t val);
int32_t lsm6dsv16bx_filt_anti_spike_get(const stmdev_ctx_t *ctx,
                                        lsm6dsv16bx_filt_anti_spike_t *val);

typedef struct {
  uint8_t drdy                          : 1;
  uint8_t irq_xl                        : 1;
  uint8_t irq_g                         : 1;
  uint8_t tdm_excep_code                : 1;
} lsm6dsv16bx_filt_settling_mask_t;
int32_t lsm6dsv16bx_filt_settling_mask_set(const stmdev_ctx_t *ctx,
                                           lsm6dsv16bx_filt_settling_mask_t val);
int32_t lsm6dsv16bx_filt_settling_mask_get(const stmdev_ctx_t *ctx,
                                           lsm6dsv16bx_filt_settling_mask_t *val);

typedef enum {
  LSM6DSV16BX_GY_ULTRA_LIGHT                      = 0x0,
  LSM6DSV16BX_GY_VERY_LIGHT                       = 0x1,
  LSM6DSV16BX_GY_LIGHT                            = 0x2,
  LSM6DSV16BX_GY_MEDIUM                           = 0x3,
  LSM6DSV16BX_GY_STRONG                           = 0x4,
  LSM6DSV16BX_GY_VERY_STRONG                      = 0x5,
  LSM6DSV16BX_GY_AGGRESSIVE                       = 0x6,
  LSM6DSV16BX_GY_XTREME                           = 0x7,
} lsm6dsv16bx_filt_gy_lp1_bandwidth_t;
int32_t lsm6dsv16bx_filt_gy_lp1_bandwidth_set(const stmdev_ctx_t *ctx,
                                              lsm6dsv16bx_filt_gy_lp1_bandwidth_t val);
int32_t lsm6dsv16bx_filt_gy_lp1_bandwidth_get(const stmdev_ctx_t *ctx,
                                              lsm6dsv16bx_filt_gy_lp1_bandwidth_t *val);

int32_t lsm6dsv16bx_filt_gy_lp1_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsv16bx_filt_gy_lp1_get(const stmdev_ctx_t *ctx, uint8_t *val);

typedef struct {
  uint8_t hpf                           : 1;
  uint8_t lpf                           : 1;
} lsm6dsv16bx_filt_ah_qvar_conf_t;
int32_t lsm6dsv16bx_filt_ah_qvar_conf_set(const stmdev_ctx_t *ctx,
                                          lsm6dsv16bx_filt_ah_qvar_conf_t val);
int32_t lsm6dsv16bx_filt_ah_qvar_conf_get(const stmdev_ctx_t *ctx,
                                          lsm6dsv16bx_filt_ah_qvar_conf_t *val);

typedef enum {
  LSM6DSV16BX_XL_ULTRA_LIGHT                      = 0x0,
  LSM6DSV16BX_XL_VERY_LIGHT                       = 0x1,
  LSM6DSV16BX_XL_LIGHT                            = 0x2,
  LSM6DSV16BX_XL_MEDIUM                           = 0x3,
  LSM6DSV16BX_XL_STRONG                           = 0x4,
  LSM6DSV16BX_XL_VERY_STRONG                      = 0x5,
  LSM6DSV16BX_XL_AGGRESSIVE                       = 0x6,
  LSM6DSV16BX_XL_XTREME                           = 0x7,
} lsm6dsv16bx_filt_xl_lp2_bandwidth_t;
int32_t lsm6dsv16bx_filt_xl_lp2_bandwidth_set(const stmdev_ctx_t *ctx,
                                              lsm6dsv16bx_filt_xl_lp2_bandwidth_t val);
int32_t lsm6dsv16bx_filt_xl_lp2_bandwidth_get(const stmdev_ctx_t *ctx,
                                              lsm6dsv16bx_filt_xl_lp2_bandwidth_t *val);

int32_t lsm6dsv16bx_filt_xl_lp2_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsv16bx_filt_xl_lp2_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsv16bx_filt_xl_hp_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsv16bx_filt_xl_hp_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsv16bx_filt_xl_fast_settling_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsv16bx_filt_xl_fast_settling_get(const stmdev_ctx_t *ctx, uint8_t *val);

typedef enum {
  LSM6DSV16BX_HP_MD_NORMAL                        = 0x0,
  LSM6DSV16BX_HP_MD_REFERENCE                     = 0x1,
} lsm6dsv16bx_filt_xl_hp_mode_t;
int32_t lsm6dsv16bx_filt_xl_hp_mode_set(const stmdev_ctx_t *ctx,
                                        lsm6dsv16bx_filt_xl_hp_mode_t val);
int32_t lsm6dsv16bx_filt_xl_hp_mode_get(const stmdev_ctx_t *ctx,
                                        lsm6dsv16bx_filt_xl_hp_mode_t *val);

typedef enum {
  LSM6DSV16BX_WK_FEED_SLOPE                       = 0x0,
  LSM6DSV16BX_WK_FEED_HIGH_PASS                   = 0x1,
  LSM6DSV16BX_WK_FEED_LP_WITH_OFFSET              = 0x2,
} lsm6dsv16bx_filt_wkup_act_feed_t;
int32_t lsm6dsv16bx_filt_wkup_act_feed_set(const stmdev_ctx_t *ctx,
                                           lsm6dsv16bx_filt_wkup_act_feed_t val);
int32_t lsm6dsv16bx_filt_wkup_act_feed_get(const stmdev_ctx_t *ctx,
                                           lsm6dsv16bx_filt_wkup_act_feed_t *val);

int32_t lsm6dsv16bx_mask_trigger_xl_settl_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsv16bx_mask_trigger_xl_settl_get(const stmdev_ctx_t *ctx, uint8_t *val);

typedef enum {
  LSM6DSV16BX_SIXD_FEED_ODR_DIV_2                 = 0x0,
  LSM6DSV16BX_SIXD_FEED_LOW_PASS                  = 0x1,
} lsm6dsv16bx_filt_sixd_feed_t;
int32_t lsm6dsv16bx_filt_sixd_feed_set(const stmdev_ctx_t *ctx,
                                       lsm6dsv16bx_filt_sixd_feed_t val);
int32_t lsm6dsv16bx_filt_sixd_feed_get(const stmdev_ctx_t *ctx,
                                       lsm6dsv16bx_filt_sixd_feed_t *val);

int32_t lsm6dsv16bx_ui_sdo_pull_up_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsv16bx_ui_sdo_pull_up_get(const stmdev_ctx_t *ctx, uint8_t *val);

typedef enum {
  LSM6DSV16BX_I2C_I3C_ENABLE                      = 0x0,
  LSM6DSV16BX_I2C_I3C_DISABLE                     = 0x1,
} lsm6dsv16bx_ui_i2c_i3c_mode_t;
int32_t lsm6dsv16bx_ui_i2c_i3c_mode_set(const stmdev_ctx_t *ctx,
                                        lsm6dsv16bx_ui_i2c_i3c_mode_t val);
int32_t lsm6dsv16bx_ui_i2c_i3c_mode_get(const stmdev_ctx_t *ctx,
                                        lsm6dsv16bx_ui_i2c_i3c_mode_t *val);

