stm32duino/LSM6DSV16BX/src/lsm6dsv16bx_reg.h
typedef enum {
  LSM6DSV16BX_SPI_4_WIRE                          = 0x0,
  LSM6DSV16BX_SPI_3_WIRE                          = 0x1,
} lsm6dsv16bx_spi_mode_t;
int32_t lsm6dsv16bx_spi_mode_set(const stmdev_ctx_t *ctx, lsm6dsv16bx_spi_mode_t val);
int32_t lsm6dsv16bx_spi_mode_get(const stmdev_ctx_t *ctx,
                                 lsm6dsv16bx_spi_mode_t *val);

int32_t lsm6dsv16bx_ui_sda_pull_up_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsv16bx_ui_sda_pull_up_get(const stmdev_ctx_t *ctx, uint8_t *val);

typedef enum {
  LSM6DSV16BX_IBI_2us                             = 0x0,
  LSM6DSV16BX_IBI_50us                            = 0x1,
  LSM6DSV16BX_IBI_1ms                             = 0x2,
  LSM6DSV16BX_IBI_25ms                            = 0x3,
} lsm6dsv16bx_i3c_ibi_time_t;
int32_t lsm6dsv16bx_i3c_ibi_time_set(const stmdev_ctx_t *ctx,
                                     lsm6dsv16bx_i3c_ibi_time_t val);
int32_t lsm6dsv16bx_i3c_ibi_time_get(const stmdev_ctx_t *ctx,
                                     lsm6dsv16bx_i3c_ibi_time_t *val);

typedef enum {
  LSM6DSV16BX_PUSH_PULL                           = 0x0,
  LSM6DSV16BX_OPEN_DRAIN                          = 0x1,
} lsm6dsv16bx_int_pin_mode_t;
int32_t lsm6dsv16bx_int_pin_mode_set(const stmdev_ctx_t *ctx,
                                     lsm6dsv16bx_int_pin_mode_t val);
int32_t lsm6dsv16bx_int_pin_mode_get(const stmdev_ctx_t *ctx,
                                     lsm6dsv16bx_int_pin_mode_t *val);

typedef enum {
  LSM6DSV16BX_ACTIVE_HIGH                         = 0x0,
  LSM6DSV16BX_ACTIVE_LOW                          = 0x1,
} lsm6dsv16bx_pin_polarity_t;
int32_t lsm6dsv16bx_pin_polarity_set(const stmdev_ctx_t *ctx,
                                     lsm6dsv16bx_pin_polarity_t val);
int32_t lsm6dsv16bx_pin_polarity_get(const stmdev_ctx_t *ctx,
                                     lsm6dsv16bx_pin_polarity_t *val);

typedef struct {
  uint8_t boot                          : 1;
  uint8_t drdy_xl                       : 1;
  uint8_t drdy_gy                       : 1;
  uint8_t drdy_temp                     : 1;
  uint8_t drdy_ah_qvar                  : 1;
  uint8_t fifo_th                       : 1;
  uint8_t fifo_ovr                      : 1;
  uint8_t fifo_full                     : 1;
  uint8_t fifo_bdr                      : 1;
  uint8_t den_flag                      : 1;
  uint8_t timestamp                     : 1; // impact on int2 signals
  uint8_t six_d                         : 1;
  uint8_t double_tap                    : 1;
  uint8_t free_fall                     : 1;
  uint8_t wake_up                       : 1;
  uint8_t single_tap                    : 1;
  uint8_t sleep_change                  : 1;
  uint8_t sleep_status                  : 1;
  uint8_t step_detector                 : 1;
  uint8_t step_count_overflow           : 1;
  uint8_t tilt                          : 1;
  uint8_t sig_mot                       : 1;
  uint8_t emb_func_stand_by             : 1; // impact on int2 signals
  uint8_t fsm_lc                        : 1;
  uint8_t fsm1                          : 1;
  uint8_t fsm2                          : 1;
  uint8_t fsm3                          : 1;
  uint8_t fsm4                          : 1;
  uint8_t fsm5                          : 1;
  uint8_t fsm6                          : 1;
  uint8_t fsm7                          : 1;
  uint8_t fsm8                          : 1;
  uint8_t mlc1                          : 1;
  uint8_t mlc2                          : 1;
  uint8_t mlc3                          : 1;
  uint8_t mlc4                          : 1;
} lsm6dsv16bx_pin_int_route_t;
int32_t lsm6dsv16bx_pin_int1_route_set(const stmdev_ctx_t *ctx,
                                       lsm6dsv16bx_pin_int_route_t val);
int32_t lsm6dsv16bx_pin_int1_route_get(const stmdev_ctx_t *ctx,
                                       lsm6dsv16bx_pin_int_route_t *val);
int32_t lsm6dsv16bx_pin_int2_route_set(const stmdev_ctx_t *ctx,
                                       lsm6dsv16bx_pin_int_route_t val);
int32_t lsm6dsv16bx_pin_int2_route_get(const stmdev_ctx_t *ctx,
                                       lsm6dsv16bx_pin_int_route_t *val);

int32_t lsm6dsv16bx_pin_int_en_when_i2c_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsv16bx_pin_int_en_when_i2c_get(const stmdev_ctx_t *ctx, uint8_t *val);

typedef enum {
  LSM6DSV16BX_ALL_INT_PULSED                      = 0x0,
  LSM6DSV16BX_BASE_LATCHED_EMB_PULSED             = 0x1,
  LSM6DSV16BX_BASE_PULSED_EMB_LATCHED             = 0x2,
  LSM6DSV16BX_ALL_INT_LATCHED                     = 0x3,
} lsm6dsv16bx_int_notification_t;
int32_t lsm6dsv16bx_int_notification_set(const stmdev_ctx_t *ctx,
                                         lsm6dsv16bx_int_notification_t val);
int32_t lsm6dsv16bx_int_notification_get(const stmdev_ctx_t *ctx,
                                         lsm6dsv16bx_int_notification_t *val);

typedef enum {
  LSM6DSV16BX_XL_AND_GY_NOT_AFFECTED              = 0x0,
  LSM6DSV16BX_XL_LOW_POWER_GY_NOT_AFFECTED        = 0x1,
  LSM6DSV16BX_XL_LOW_POWER_GY_SLEEP               = 0x2,
  LSM6DSV16BX_XL_LOW_POWER_GY_POWER_DOWN          = 0x3,
} lsm6dsv16bx_act_mode_t;
int32_t lsm6dsv16bx_act_mode_set(const stmdev_ctx_t *ctx, lsm6dsv16bx_act_mode_t val);
int32_t lsm6dsv16bx_act_mode_get(const stmdev_ctx_t *ctx,
                                 lsm6dsv16bx_act_mode_t *val);

typedef enum {
  LSM6DSV16BX_SLEEP_TO_ACT_AT_1ST_SAMPLE          = 0x0,
  LSM6DSV16BX_SLEEP_TO_ACT_AT_2ND_SAMPLE          = 0x1,
  LSM6DSV16BX_SLEEP_TO_ACT_AT_3RD_SAMPLE          = 0x2,
  LSM6DSV16BX_SLEEP_TO_ACT_AT_4th_SAMPLE          = 0x3,
} lsm6dsv16bx_act_from_sleep_to_act_dur_t;
int32_t lsm6dsv16bx_act_from_sleep_to_act_dur_set(const stmdev_ctx_t *ctx,
                                                  lsm6dsv16bx_act_from_sleep_to_act_dur_t val);
int32_t lsm6dsv16bx_act_from_sleep_to_act_dur_get(const stmdev_ctx_t *ctx,
                                                  lsm6dsv16bx_act_from_sleep_to_act_dur_t *val);

