stm32duino/LSM6DSV16BX/src/lsm6dsv16bx_reg.h
typedef enum {
  LSM6DSV16BX_1Hz875                              = 0x0,
  LSM6DSV16BX_15Hz                                = 0x1,
  LSM6DSV16BX_30Hz                                = 0x2,
  LSM6DSV16BX_60Hz                                = 0x3,
} lsm6dsv16bx_act_sleep_xl_odr_t;
int32_t lsm6dsv16bx_act_sleep_xl_odr_set(const stmdev_ctx_t *ctx,
                                         lsm6dsv16bx_act_sleep_xl_odr_t val);
int32_t lsm6dsv16bx_act_sleep_xl_odr_get(const stmdev_ctx_t *ctx,
                                         lsm6dsv16bx_act_sleep_xl_odr_t *val);

typedef struct {
  uint32_t wk_ths_mg;
  uint32_t inact_ths_mg;
} lsm6dsv16bx_act_thresholds_t;
int32_t lsm6dsv16bx_act_thresholds_set(const stmdev_ctx_t *ctx,
                                       lsm6dsv16bx_act_thresholds_t val);
int32_t lsm6dsv16bx_act_thresholds_get(const stmdev_ctx_t *ctx,
                                       lsm6dsv16bx_act_thresholds_t *val);

typedef struct {
  uint8_t shock                         : 2;
  uint8_t quiet                         : 4;
} lsm6dsv16bx_act_wkup_time_windows_t;
int32_t lsm6dsv16bx_act_wkup_time_windows_set(const stmdev_ctx_t *ctx,
                                              lsm6dsv16bx_act_wkup_time_windows_t val);
int32_t lsm6dsv16bx_act_wkup_time_windows_get(const stmdev_ctx_t *ctx,
                                              lsm6dsv16bx_act_wkup_time_windows_t *val);

typedef struct {
  uint8_t tap_x_en                      : 1;
  uint8_t tap_y_en                      : 1;
  uint8_t tap_z_en                      : 1;
} lsm6dsv16bx_tap_detection_t;
int32_t lsm6dsv16bx_tap_detection_set(const stmdev_ctx_t *ctx,
                                      lsm6dsv16bx_tap_detection_t val);
int32_t lsm6dsv16bx_tap_detection_get(const stmdev_ctx_t *ctx,
                                      lsm6dsv16bx_tap_detection_t *val);

typedef struct {
  uint8_t x                             : 1;
  uint8_t y                             : 1;
  uint8_t z                             : 1;
} lsm6dsv16bx_tap_thresholds_t;
int32_t lsm6dsv16bx_tap_thresholds_set(const stmdev_ctx_t *ctx,
                                       lsm6dsv16bx_tap_thresholds_t val);
int32_t lsm6dsv16bx_tap_thresholds_get(const stmdev_ctx_t *ctx,
                                       lsm6dsv16bx_tap_thresholds_t *val);


typedef enum {
  LSM6DSV16BX_XYZ                                 = 0x3,
  LSM6DSV16BX_YXZ                                 = 0x5,
  LSM6DSV16BX_XZY                                 = 0x6,
  LSM6DSV16BX_ZYX                                 = 0x0,
  LSM6DSV16BX_YZX                                 = 0x1,
  LSM6DSV16BX_ZXY                                 = 0x2,
} lsm6dsv16bx_tap_axis_priority_t;
int32_t lsm6dsv16bx_tap_axis_priority_set(const stmdev_ctx_t *ctx,
                                          lsm6dsv16bx_tap_axis_priority_t val);
int32_t lsm6dsv16bx_tap_axis_priority_get(const stmdev_ctx_t *ctx,
                                          lsm6dsv16bx_tap_axis_priority_t *val);

typedef struct {
  uint8_t shock                         : 1;
  uint8_t quiet                         : 1;
  uint8_t tap_gap                       : 1;
} lsm6dsv16bx_tap_time_windows_t;
int32_t lsm6dsv16bx_tap_time_windows_set(const stmdev_ctx_t *ctx,
                                         lsm6dsv16bx_tap_time_windows_t val);
int32_t lsm6dsv16bx_tap_time_windows_get(const stmdev_ctx_t *ctx,
                                         lsm6dsv16bx_tap_time_windows_t *val);

typedef enum {
  LSM6DSV16BX_ONLY_SINGLE                         = 0x0,
  LSM6DSV16BX_BOTH_SINGLE_DOUBLE                  = 0x1,
} lsm6dsv16bx_tap_mode_t;
int32_t lsm6dsv16bx_tap_mode_set(const stmdev_ctx_t *ctx, lsm6dsv16bx_tap_mode_t val);
int32_t lsm6dsv16bx_tap_mode_get(const stmdev_ctx_t *ctx,
                                 lsm6dsv16bx_tap_mode_t *val);

typedef enum {
  LSM6DSV16BX_DEG_80                              = 0x0,
  LSM6DSV16BX_DEG_70                              = 0x1,
  LSM6DSV16BX_DEG_60                              = 0x2,
  LSM6DSV16BX_DEG_50                              = 0x3,
} lsm6dsv16bx_6d_threshold_t;
int32_t lsm6dsv16bx_6d_threshold_set(const stmdev_ctx_t *ctx,
                                     lsm6dsv16bx_6d_threshold_t val);
int32_t lsm6dsv16bx_6d_threshold_get(const stmdev_ctx_t *ctx,
                                     lsm6dsv16bx_6d_threshold_t *val);

int32_t lsm6dsv16bx_ff_time_windows_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsv16bx_ff_time_windows_get(const stmdev_ctx_t *ctx, uint8_t *val);

typedef enum {
  LSM6DSV16BX_156_mg                              = 0x0,
  LSM6DSV16BX_219_mg                              = 0x1,
  LSM6DSV16BX_250_mg                              = 0x2,
  LSM6DSV16BX_312_mg                              = 0x3,
  LSM6DSV16BX_344_mg                              = 0x4,
  LSM6DSV16BX_406_mg                              = 0x5,
  LSM6DSV16BX_469_mg                              = 0x6,
  LSM6DSV16BX_500_mg                              = 0x7,
} lsm6dsv16bx_ff_thresholds_t;
int32_t lsm6dsv16bx_ff_thresholds_set(const stmdev_ctx_t *ctx,
                                      lsm6dsv16bx_ff_thresholds_t val);
int32_t lsm6dsv16bx_ff_thresholds_get(const stmdev_ctx_t *ctx,
                                      lsm6dsv16bx_ff_thresholds_t *val);

int32_t lsm6dsv16bx_fifo_watermark_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsv16bx_fifo_watermark_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsv16bx_fifo_xl_dual_fsm_batch_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsv16bx_fifo_xl_dual_fsm_batch_get(const stmdev_ctx_t *ctx, uint8_t *val);

typedef enum {
  LSM6DSV16BX_CMP_DISABLE                         = 0x0,
  LSM6DSV16BX_CMP_8_TO_1                          = 0x1,
  LSM6DSV16BX_CMP_16_TO_1                         = 0x2,
  LSM6DSV16BX_CMP_32_TO_1                         = 0x3,
} lsm6dsv16bx_fifo_compress_algo_t;
int32_t lsm6dsv16bx_fifo_compress_algo_set(const stmdev_ctx_t *ctx,
                                           lsm6dsv16bx_fifo_compress_algo_t val);
int32_t lsm6dsv16bx_fifo_compress_algo_get(const stmdev_ctx_t *ctx,
                                           lsm6dsv16bx_fifo_compress_algo_t *val);

int32_t lsm6dsv16bx_fifo_virtual_sens_odr_chg_set(const stmdev_ctx_t *ctx,
                                                  uint8_t val);
int32_t lsm6dsv16bx_fifo_virtual_sens_odr_chg_get(const stmdev_ctx_t *ctx,
                                                  uint8_t *val);

int32_t lsm6dsv16bx_fifo_compress_algo_real_time_set(const stmdev_ctx_t *ctx,
                                                     uint8_t val);
int32_t lsm6dsv16bx_fifo_compress_algo_real_time_get(const stmdev_ctx_t *ctx,
                                                     uint8_t *val);

int32_t lsm6dsv16bx_fifo_stop_on_wtm_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsv16bx_fifo_stop_on_wtm_get(const stmdev_ctx_t *ctx, uint8_t *val);

