stm32duino/LSM6DSV16BX/src/lsm6dsv16bx_reg.h
typedef struct {
  uint8_t step_counter_enable           : 1;
  uint8_t false_step_rej                : 1;
} lsm6dsv16bx_stpcnt_mode_t;
int32_t lsm6dsv16bx_stpcnt_mode_set(const stmdev_ctx_t *ctx,
                                    lsm6dsv16bx_stpcnt_mode_t val);
int32_t lsm6dsv16bx_stpcnt_mode_get(const stmdev_ctx_t *ctx,
                                    lsm6dsv16bx_stpcnt_mode_t *val);

int32_t lsm6dsv16bx_stpcnt_steps_get(const stmdev_ctx_t *ctx, uint16_t *val);

int32_t lsm6dsv16bx_stpcnt_rst_step_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsv16bx_stpcnt_rst_step_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsv16bx_stpcnt_debounce_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsv16bx_stpcnt_debounce_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsv16bx_stpcnt_period_set(const stmdev_ctx_t *ctx, uint16_t val);
int32_t lsm6dsv16bx_stpcnt_period_get(const stmdev_ctx_t *ctx, uint16_t *val);

int32_t lsm6dsv16bx_sigmot_mode_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsv16bx_sigmot_mode_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsv16bx_tilt_mode_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsv16bx_tilt_mode_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsv16bx_sflp_game_rotation_set(const stmdev_ctx_t *ctx, uint16_t val);
int32_t lsm6dsv16bx_sflp_game_rotation_get(const stmdev_ctx_t *ctx, uint16_t *val);

typedef struct {
  float_t gbias_x; /* dps */
  float_t gbias_y; /* dps */
  float_t gbias_z; /* dps */
} lsm6dsv16bx_sflp_gbias_t;
int32_t lsm6dsv16bx_sflp_game_gbias_set(const stmdev_ctx_t *ctx,
                                        lsm6dsv16bx_sflp_gbias_t *val);

int32_t lsm6dsv16bx_sflp_configure(const stmdev_ctx_t *ctx);

typedef enum {
  LSM6DSV16BX_SFLP_15Hz                           = 0x0,
  LSM6DSV16BX_SFLP_30Hz                           = 0x1,
  LSM6DSV16BX_SFLP_60Hz                           = 0x2,
  LSM6DSV16BX_SFLP_120Hz                          = 0x3,
  LSM6DSV16BX_SFLP_240Hz                          = 0x4,
  LSM6DSV16BX_SFLP_480Hz                          = 0x5,
} lsm6dsv16bx_sflp_data_rate_t;
int32_t lsm6dsv16bx_sflp_data_rate_set(const stmdev_ctx_t *ctx,
                                       lsm6dsv16bx_sflp_data_rate_t val);
int32_t lsm6dsv16bx_sflp_data_rate_get(const stmdev_ctx_t *ctx,
                                       lsm6dsv16bx_sflp_data_rate_t *val);

typedef enum {
  LSM6DSV16BX_PROTECT_CTRL_REGS                   = 0x0,
  LSM6DSV16BX_WRITE_CTRL_REG                      = 0x1,
} lsm6dsv16bx_fsm_permission_t;
int32_t lsm6dsv16bx_fsm_permission_set(const stmdev_ctx_t *ctx,
                                       lsm6dsv16bx_fsm_permission_t val);
int32_t lsm6dsv16bx_fsm_permission_get(const stmdev_ctx_t *ctx,
                                       lsm6dsv16bx_fsm_permission_t *val);

typedef enum {
  LSM6DSV16BX_STD_IF_CONTROL                      = 0x0,
  LSM6DSV16BX_FSM_CONTROL                         = 0x1,
} lsm6dsv16bx_fsm_permission_status_t;
int32_t lsm6dsv16bx_fsm_permission_status(const stmdev_ctx_t *ctx,
                                          lsm6dsv16bx_fsm_permission_status_t *val);

typedef struct {
  uint8_t fsm1_en                       : 1;
  uint8_t fsm2_en                       : 1;
  uint8_t fsm3_en                       : 1;
  uint8_t fsm4_en                       : 1;
  uint8_t fsm5_en                       : 1;
  uint8_t fsm6_en                       : 1;
  uint8_t fsm7_en                       : 1;
  uint8_t fsm8_en                       : 1;
} lsm6dsv16bx_fsm_mode_t;
int32_t lsm6dsv16bx_fsm_mode_set(const stmdev_ctx_t *ctx, lsm6dsv16bx_fsm_mode_t val);
int32_t lsm6dsv16bx_fsm_mode_get(const stmdev_ctx_t *ctx,
                                 lsm6dsv16bx_fsm_mode_t *val);

int32_t lsm6dsv16bx_fsm_long_cnt_set(const stmdev_ctx_t *ctx, uint16_t val);
int32_t lsm6dsv16bx_fsm_long_cnt_get(const stmdev_ctx_t *ctx, uint16_t *val);

typedef struct {
  uint8_t fsm_outs1;
  uint8_t fsm_outs2;
  uint8_t fsm_outs3;
  uint8_t fsm_outs4;
  uint8_t fsm_outs5;
  uint8_t fsm_outs6;
  uint8_t fsm_outs7;
  uint8_t fsm_outs8;
} lsm6dsv16bx_fsm_out_t;
int32_t lsm6dsv16bx_fsm_out_get(const stmdev_ctx_t *ctx, lsm6dsv16bx_fsm_out_t *val);

typedef enum {
  LSM6DSV16BX_FSM_15Hz                            = 0x0,
  LSM6DSV16BX_FSM_30Hz                            = 0x1,
  LSM6DSV16BX_FSM_60Hz                            = 0x2,
  LSM6DSV16BX_FSM_120Hz                           = 0x3,
  LSM6DSV16BX_FSM_240Hz                           = 0x4,
  LSM6DSV16BX_FSM_480Hz                           = 0x5,
  LSM6DSV16BX_FSM_960Hz                           = 0x6,
} lsm6dsv16bx_fsm_data_rate_t;
int32_t lsm6dsv16bx_fsm_data_rate_set(const stmdev_ctx_t *ctx,
                                      lsm6dsv16bx_fsm_data_rate_t val);
int32_t lsm6dsv16bx_fsm_data_rate_get(const stmdev_ctx_t *ctx,
                                      lsm6dsv16bx_fsm_data_rate_t *val);

int32_t lsm6dsv16bx_fsm_long_cnt_timeout_set(const stmdev_ctx_t *ctx, uint16_t val);
int32_t lsm6dsv16bx_fsm_long_cnt_timeout_get(const stmdev_ctx_t *ctx, uint16_t *val);

int32_t lsm6dsv16bx_fsm_number_of_programs_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsv16bx_fsm_number_of_programs_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsv16bx_fsm_start_address_set(const stmdev_ctx_t *ctx, uint16_t val);
int32_t lsm6dsv16bx_fsm_start_address_get(const stmdev_ctx_t *ctx, uint16_t *val);

typedef enum {
  LSM6DSV16BX_MLC_OFF                             = 0x0,
  LSM6DSV16BX_MLC_ON                              = 0x1,
  LSM6DSV16BX_MLC_ON_BEFORE_FSM                   = 0x2,
} lsm6dsv16bx_mlc_mode_t;
int32_t lsm6dsv16bx_mlc_set(const stmdev_ctx_t *ctx, lsm6dsv16bx_mlc_mode_t val);
int32_t lsm6dsv16bx_mlc_get(const stmdev_ctx_t *ctx, lsm6dsv16bx_mlc_mode_t *val);

typedef enum {
  LSM6DSV16BX_MLC_15Hz                            = 0x0,
  LSM6DSV16BX_MLC_30Hz                            = 0x1,
  LSM6DSV16BX_MLC_60Hz                            = 0x2,
  LSM6DSV16BX_MLC_120Hz                           = 0x3,
  LSM6DSV16BX_MLC_240Hz                           = 0x4,
  LSM6DSV16BX_MLC_480Hz                           = 0x5,
  LSM6DSV16BX_MLC_960Hz                           = 0x6,
} lsm6dsv16bx_mlc_data_rate_t;
