stm32duino/LSM6DSV16BX/src/lsm6dsv16bx_reg.h
int32_t lsm6dsv16bx_mlc_data_rate_set(const stmdev_ctx_t *ctx,
                                      lsm6dsv16bx_mlc_data_rate_t val);
int32_t lsm6dsv16bx_mlc_data_rate_get(const stmdev_ctx_t *ctx,
                                      lsm6dsv16bx_mlc_data_rate_t *val);

typedef struct {
  uint8_t mlc1_src;
  uint8_t mlc2_src;
  uint8_t mlc3_src;
  uint8_t mlc4_src;
} lsm6dsv16bx_mlc_out_t;
int32_t lsm6dsv16bx_mlc_out_get(const stmdev_ctx_t *ctx, lsm6dsv16bx_mlc_out_t *val);

int32_t lsm6dsv16bx_mlc_qvar_sensitivity_set(const stmdev_ctx_t *ctx, uint16_t val);
int32_t lsm6dsv16bx_mlc_qvar_sensitivity_get(const stmdev_ctx_t *ctx, uint16_t *val);

int32_t lsm6dsv16bx_xl_offset_on_out_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsv16bx_xl_offset_on_out_get(const stmdev_ctx_t *ctx, uint8_t *val);

typedef struct {
  float_t z_mg;
  float_t y_mg;
  float_t x_mg;
} lsm6dsv16bx_xl_offset_mg_t;
int32_t lsm6dsv16bx_xl_offset_mg_set(const stmdev_ctx_t *ctx,
                                     lsm6dsv16bx_xl_offset_mg_t val);
int32_t lsm6dsv16bx_xl_offset_mg_get(const stmdev_ctx_t *ctx,
                                     lsm6dsv16bx_xl_offset_mg_t *val);

typedef struct {
  uint8_t ah_qvar1_en                   : 1;
  uint8_t ah_qvar2_en                   : 1;
  uint8_t swaps                         : 1;
} lsm6dsv16bx_ah_qvar_mode_t;
int32_t lsm6dsv16bx_ah_qvar_mode_set(const stmdev_ctx_t *ctx,
                                     lsm6dsv16bx_ah_qvar_mode_t val);
int32_t lsm6dsv16bx_ah_qvar_mode_get(const stmdev_ctx_t *ctx,
                                     lsm6dsv16bx_ah_qvar_mode_t *val);

typedef enum {
  LSM6DSV16BX_2400MOhm                            = 0x0,
  LSM6DSV16BX_730MOhm                             = 0x1,
  LSM6DSV16BX_300MOhm                             = 0x2,
  LSM6DSV16BX_255MOhm                             = 0x3,
} lsm6dsv16bx_ah_qvar_zin_t;
int32_t lsm6dsv16bx_ah_qvar_zin_set(const stmdev_ctx_t *ctx,
                                    lsm6dsv16bx_ah_qvar_zin_t val);
int32_t lsm6dsv16bx_ah_qvar_zin_get(const stmdev_ctx_t *ctx,
                                    lsm6dsv16bx_ah_qvar_zin_t *val);

int32_t lsm6dsv16bx_fsm_qvar_sensitivity_set(const stmdev_ctx_t *ctx, uint16_t val);
int32_t lsm6dsv16bx_fsm_qvar_sensitivity_get(const stmdev_ctx_t *ctx, uint16_t *val);

typedef enum {
  LSM6DSV16BX_SW_RST_DYN_ADDRESS_RST              = 0x0,
  LSM6DSV16BX_I3C_GLOBAL_RST                      = 0x1,
} lsm6dsv16bx_i3c_reset_mode_t;
int32_t lsm6dsv16bx_i3c_reset_mode_set(const stmdev_ctx_t *ctx,
                                       lsm6dsv16bx_i3c_reset_mode_t val);
int32_t lsm6dsv16bx_i3c_reset_mode_get(const stmdev_ctx_t *ctx,
                                       lsm6dsv16bx_i3c_reset_mode_t *val);

int32_t lsm6dsv16bx_tdm_dis_wclk_pull_up_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsv16bx_tdm_dis_wclk_pull_up_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsv16bx_tdm_tdmout_pull_up_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsv16bx_tdm_tdmout_pull_up_get(const stmdev_ctx_t *ctx, uint8_t *val);

typedef enum {
  LSM6DSV16BX_WCLK_16kHZ_BCLK_2048kHz             = 0x1,
  LSM6DSV16BX_WCLK_8kHZ_BCLK_2048kHz              = 0x4,
} lsm6dsv16bx_tdm_wclk_bclk_t;
int32_t lsm6dsv16bx_tdm_wclk_bclk_set(const stmdev_ctx_t *ctx,
                                      lsm6dsv16bx_tdm_wclk_bclk_t val);
int32_t lsm6dsv16bx_tdm_wclk_bclk_get(const stmdev_ctx_t *ctx,
                                      lsm6dsv16bx_tdm_wclk_bclk_t *val);

typedef enum {
  LSM6DSV16BX_SLOT_012                            = 0x0,
  LSM6DSV16BX_SLOT_456                            = 0x1,
} lsm6dsv16bx_tdm_slot_t;
int32_t lsm6dsv16bx_tdm_slot_set(const stmdev_ctx_t *ctx, lsm6dsv16bx_tdm_slot_t val);
int32_t lsm6dsv16bx_tdm_slot_get(const stmdev_ctx_t *ctx,
                                 lsm6dsv16bx_tdm_slot_t *val);

typedef enum {
  LSM6DSV16BX_BCLK_RISING                         = 0x0,
  LSM6DSV16BX_BCLK_FALLING                        = 0x1,
} lsm6dsv16bx_tdm_bclk_edge_t;
int32_t lsm6dsv16bx_tdm_bclk_edge_set(const stmdev_ctx_t *ctx,
                                      lsm6dsv16bx_tdm_bclk_edge_t val);
int32_t lsm6dsv16bx_tdm_bclk_edge_get(const stmdev_ctx_t *ctx,
                                      lsm6dsv16bx_tdm_bclk_edge_t *val);

int32_t lsm6dsv16bx_tdm_delayed_conf_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsv16bx_tdm_delayed_conf_get(const stmdev_ctx_t *ctx, uint8_t *val);

typedef enum {
  LSM6DSV16BX_TDM_ORDER_ZYX                       = 0x0,
  LSM6DSV16BX_TDM_ORDER_XZY                       = 0x1,
  LSM6DSV16BX_TDM_ORDER_XYZ                       = 0x2,
} lsm6dsv16bx_tdm_axis_order_t;
int32_t lsm6dsv16bx_tdm_axis_order_set(const stmdev_ctx_t *ctx,
                                       lsm6dsv16bx_tdm_axis_order_t val);
int32_t lsm6dsv16bx_tdm_axis_order_get(const stmdev_ctx_t *ctx,
                                       lsm6dsv16bx_tdm_axis_order_t *val);

typedef enum {
  LSM6DSV16BX_TDM_2g                              = 0x0,
  LSM6DSV16BX_TDM_4g                              = 0x1,
  LSM6DSV16BX_TDM_8g                              = 0x2,
} lsm6dsv16bx_tdm_xl_full_scale_t;
int32_t lsm6dsv16bx_tdm_xl_full_scale_set(const stmdev_ctx_t *ctx,
                                          lsm6dsv16bx_tdm_xl_full_scale_t val);
int32_t lsm6dsv16bx_tdm_xl_full_scale_get(const stmdev_ctx_t *ctx,
                                          lsm6dsv16bx_tdm_xl_full_scale_t *val);

/**
  * @}
  *
  */

#ifdef __cplusplus
}
#endif

#endif /*LSM6DSV16BX_DRIVER_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
